[
  {
    "name": "Aespa",
    "members": ["Karina", "Giselle", "Winter", "Ningning"],
    "genre": "Kpop",
    "logoCredits": "Aespa. Credit: SM Entertainment - Source: NME, https://www.nme.com/news/music/aespa-reveal-girls-was-supposed-to-be-released-a-lot-earlier-3263683",
    "logo": "https://www.nme.com/wp-content/uploads/2022/07/aespa-girls-concept-photo-released-later.jpg",
    "bio": "Aespa is a South Korean girl group formed by SM Entertainment in 2020. The group consists of four members: Karina, Giselle, Winter, and Ningning. Debuting with their single 'Black Mamba,' aespa quickly gained attention for their innovative concept, which blends the virtual world with reality through their virtual avatars. Their music is characterized by a mix of various genres, including pop, hip-hop, and electronic elements. With their mesmerizing performances, captivating visuals, and unique concept, aespa has rapidly become one of the most talked-about acts in the K-pop scene",
    "slug": "aespa"
  },
  {
    "name": "Ateez",
    "members": ["Hongjoong", "Seonghwa", "Yunho", "Yeosang", "San", "Mingi", "Wooyoung", "Jongho"],

    "logoCredits": "ATEEZ. Credit: KQ ENTERTAINMENT - Source: Forbes, https://www.forbes.com/sites/jeffbenjamin/2021/03/31/ateez-discuss-the-confidence--creative-motivations-behind-zero--fever-part2-album/",
    "logo": "https://imageio.forbes.com/specials-images/imageserve/60643c7a2a2850f86ecb16e2/KQ-Entertainment-K-pop-boy-band-ATEEZ--Zero--Fever-Part-2--6th-mini-album-group-photo/0x0.jpg?format=jpg&crop=2716,1810,x0,y0,safe&width=960",
    "bio": "ATEEZ is a South Korean boy group formed by KQ Entertainment in 2018. Comprising eight members - Hongjoong, Seonghwa, Yunho, Yeosang, San, Mingi, Wooyoung, and Jongho - ATEEZ quickly made their mark in the K-pop industry with their powerful performances, intricate choreography, and distinctive musical style that blends elements of EDM, hip-hop, and rock. Debuting with their EP 'Treasure EP.1: All to Zero,' they have since released multiple successful albums, earning them a dedicated international fanbase known as ATINY. ATEEZ is known for their adventurous and dynamic concepts, often drawing inspiration from exploration and adventure themes. Their passion, energy, and talent have solidified their position as one of the leading acts in the global K-pop scene",
    "genre": "Kpop",
    "slug": "ateez"
  },
  {
    "name": "Blackpink",
    "members": ["Jisoo", "Jennie", "Rosé", "Lisa"],
    "genre": "Kpop",
    "logoCredits": "BLACKPINK. Credit: YG Entertainment - Source: NME, https://www.nme.com/news/music/blackpink-shut-down-title-track-born-pink-album-3305618",
    "logo": "https://www.nme.com/wp-content/uploads/2022/09/blackpink-title-track-shut-down-born-pink-album-announcement.jpg",
    "bio": "BLACKPINK is a South Korean girl group formed by YG Entertainment in 2016. Consisting of four members - Jisoo, Jennie, Rosé, and Lisa - BLACKPINK quickly rose to fame with their powerful performances, catchy music, and captivating visuals. Debuting with the single album 'Square One,' they garnered widespread attention for their distinct blend of pop, hip-hop, and EDM, coupled with fierce choreography. BLACKPINK has broken numerous records, including being the first K-pop girl group to perform at Coachella and the first to reach one billion views on YouTube for their music video 'DDU-DU DDU-DU.' With their global appeal, fashion-forward image, and chart-topping hits, BLACKPINK has solidified their status as one of the most influential and iconic girl groups in the world",
    "slug": "blackpink"
  },
  {
    "name": "BTS",
    "members": ["Jin", "Suga", "J-Hope", "RM", "Jimin", "V", "Jungkook"],
    "logoCredits": "By Dawbell/Big Hit - Source: Metro, https://metro.co.uk/2018/08/16/bts-drop-second-round-concept-images-love-answer-7848633/",
    "logo": "https://metro.co.uk/wp-content/uploads/2018/08/1_f_bts-d924.jpg?quality=90&strip=all",
    "bio": "BTS, also known as the Bangtan Boys, is a South Korean boy band formed by Big Hit Entertainment in 2013. Consisting of seven members - RM, Jin, Suga, J-Hope, Jimin, V, and Jungkook - BTS has taken the world by storm with their powerful music, socially conscious lyrics, and mesmerizing performances. Debuting with the single album '2 Cool 4 Skool,' they've since achieved unprecedented success, breaking numerous records and earning a dedicated global fanbase known as the ARMY. BTS has been recognized for their influence on music, culture, and philanthropy, becoming one of the most influential and acclaimed boy bands in the world",
    "genre": "Kpop",
    "slug": "bts"
  },
  {
    "name": "The Boyz",
    "members": ["Sangyeon", "Jacob", "Younghoon", "Hyunjae", "Juyeon", "Kevin", "New", "Q", "Haknyeon", "Sunwoo", "Eric"],
    "logoCredits": "THE BOYZ official FB page - Source: HallyuSG, https://www.hallyusg.net/2019/05/16/feature-theboyz/",
    "logo": "https://www.hallyusg.net/wp-content/uploads/2019/05/theboyz.jpg",
    "bio": "THE BOYZ is a South Korean boy group formed by Cre.Ker Entertainment in 2017. Comprising eleven members - Sangyeon, Jacob, Younghoon, Hyunjae, Juyeon, Kevin, New, Q, Juhaknyeon, Sunwoo, and Eric - THE BOYZ has garnered attention for their energetic performances, diverse talents, and vibrant personalities. Debuting with the mini-album 'The First,' they quickly gained popularity with their catchy music and captivating stage presence. With a growing international fanbase, THE BOYZ continues to showcase their versatility and charm, solidifying their position as rising stars in the K-pop industry.",
    "genre": "Kpop",
    "slug": "the-boyz"
  },
  {
    "name": "Exo",
    "members": ["Xiumin", "Baekhyun", "Chen", "Lay", "Sehun", "Chanyeol", "D.O.", "Kai", "Suho"],
    "logoCredits": "EXO. Credit: SM Entertainment - Source: The Bias List, https://thebiaslist.com/2018/12/13/song-review-exo-love-shot/",
    "logo": "https://thebiaslist.com/wp-content/uploads/2018/12/EXO-Love-Shot.jpg",
    "bio": "EXO is a South Korean-Chinese boy group formed by SM Entertainment in 2012. Initially consisting of twelve members, the group is now composed of nine members: Xiumin, Suho, Lay, Baekhyun, Chen, Chanyeol, D.O., Kai, and Sehun. Known for their powerful vocals, intricate choreography, and diverse music style that spans from pop to R&B and hip-hop, EXO has become one of the most influential and successful K-pop acts globally. Debuting with the single 'Mama,' they've released numerous hit albums and singles, earned numerous awards, and sold out concerts worldwide. With a dedicated fanbase known as EXO-Ls, EXO continues to make waves in the music industry",
    "genre": "Kpop",
    "slug": "exo"
  },
  {
    "name": "Enhypen",
    "members": ["Sunghoon", "Sunoo", "Jungwon", "Ni-ki", "Heeseung", "Jay", "Jake"],
    "logoCredits": "Pak Bae for NME - Source: NME, https://www.nme.com/news/music/enhypen-the-cover-playlist-3466672",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/Enhypen-2023-Credit-Pak-Bae@2000x1270-1392x884.jpg",
    "bio": "ENHYPEN is a South Korean boy group formed by Belift Lab through the survival show 'I-LAND' in 2020. Consisting of seven members - Jungwon, Heeseung, Jay, Jake, Sunghoon, Sunoo, and Ni-ki - ENHYPEN quickly gained attention for their exceptional talent, versatility, and captivating performances. Debuting with the mini-album 'BORDER: DAY ONE,' they showcased their dynamic music style, blending elements of pop, hip-hop, and EDM. With their strong visuals, synchronized choreography, and engaging music, ENHYPEN has rapidly emerged as one of the most promising acts in the K-pop industry, capturing the hearts of fans globally",
    "genre": "Kpop",
    "slug": "enhypen"
  },
  {
    "name": "Everglow",
    "members": ["E:U", "Onda", "Yiren", "Sihyeon", "Mia", "Aisha"],
    "logoCredits": "Yuehua Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/everglow-kpop-group-interview",
    "logo": "https://assets.teenvogue.com/photos/60b9272bfb7e96265602da59/1:1/w_960,c_limit/everglow02.jpeg",
    "bio": "EVERGLOW is a South Korean girl group formed by Yuehua Entertainment in 2019. Comprising six members - E:U, Sihyeon, Mia, Onda, Aisha, and Yiren - EVERGLOW quickly made an impact with their powerful performances, catchy music, and striking visuals. Debuting with the single album 'Arrival of Everglow,' they gained attention for their dynamic choreography and diverse music style, incorporating elements of pop, EDM, and hip-hop. With their charismatic stage presence and energetic performances, EVERGLOW has garnered a dedicated international fanbase and continues to shine as one of the rising stars in the K-pop scene.",
    "genre": "Kpop",
    "slug": "everglow"
  },

  {
    "name": "(G)I-DLE",
    "members": ["Minnie", "Miyeon", "Soyeon", "Yuqi", "Shuhua"],
    "logoCredits": "CUBE ENTERTAINMENT - Source: Uproxx, https://uproxx.com/pop/gidle-nxde-top-40-radio-charts/",
    "logo": "https://uproxx.com/wp-content/uploads/2023/01/GIDLE-N-710.jpg?w=640",
    "bio": "(G)I-DLE is a South Korean girl group formed by CUBE Entertainment in 2018. Consisting of six members - Miyeon, Minnie, Soyeon, Soojin, Yuqi, and Shuhua - (G)I-DLE quickly gained attention for their unique sound, bold concepts, and charismatic performances. Debuting with the single 'LATATA,' they showcased their versatility by blending various genres such as pop, hip-hop, and EDM. With their empowering lyrics and captivating stage presence, (G)I-DLE has earned acclaim both domestically and internationally, becoming known for their innovation and creativity in the K-pop industry",
    "genre": "Kpop",
    "slug": "g-idle"
  },
  {
    "name": "Girls Generation",
    "members": ["Sunny", "Tiffany", "Hyoyeon", "Yoona", "Seohyun", "Yuri", "Taeyeon", "Sooyoung"],
    "logoCredits": "Girls' Generation. Credit: SM Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/girls-generation-decade-10-years-k-pop-fans-interview-7934088/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/girls-generation-holiday-night-billboard-1548.jpg",
    "bio": "Girls' Generation, also known as SNSD, is a legendary South Korean girl group formed by SM Entertainment in 2007. Consisting of members Taeyeon, Sunny, Tiffany, Hyoyeon, Yuri, Sooyoung, Yoona, and Seohyun, Girls' Generation quickly rose to fame with their infectious pop anthems, impeccable choreography, and charismatic performances. Debuting with the single 'Into the New World,' they became one of the pioneering acts in the Hallyu wave, spreading K-pop's popularity globally. With numerous hits like 'Gee,' 'Genie,' and 'I Got a Boy,' Girls' Generation has solidified their status as one of the most iconic and influential girl groups in the history of K-pop",
    "genre": "Kpop",
    "slug": "girls-generation"
  },
  {
    "name": "Got7",
    "members": ["Mark", "Jay B", "Jackson", "Jinyoung", "Youngjae", "BamBam", "Yugyeom"],
    "logoCredits": "JYP Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/a-look-back-at-got7s-career-from-their-electrifying-debut-to-stadium-concerts-9324104/",
    "logo": "https://www.billboard.com/wp-content/uploads/2020/02/GOT7-press-photo-2020-billboard-1548-1582816394.jpg",
    "bio": "GOT7 is a South Korean boy group formed by JYP Entertainment in 2014. Comprising seven members - JB, Mark, Jackson, Jinyoung, Youngjae, BamBam, and Yugyeom - GOT7 quickly gained recognition for their energetic performances, strong vocals, and diverse music style. Debuting with the single 'Girls Girls Girls,' they showcased their versatility with a blend of pop, hip-hop, and R&B influences. With chart-topping hits like 'Just Right,' 'Hard Carry,' and 'Lullaby,' GOT7 has become known for their global appeal, captivating fans around the world with their infectious music and engaging personalities. In 2021, the group decided to depart from JYP Entertainment after seven years, but their legacy in the K-pop industry remains significant.",
    "genre": "Kpop",
    "slug": "got7"
  },
  {
    "name": "Ikon",
    "members": ["Song", "DK", "Jay", "Chan", "Bobby", "Ju-ne"],
    "logoCredits": "143 Entertainment - Source: Soompi, https://www.soompi.com/article/1585029wpp/ikon-tops-itunes-charts-around-the-world-with-take-off",
    "logo": "https://6.soompi.io/wp-content/uploads/image/20230424093735_ikon-1-5.jpeg?s=900x600&e=t",
    "bio": "iKON is a South Korean boy group under 143 Entertainment. Formed from the survival show Mix & Match by YG entertainment, iKON debuted in 2015 with seven members. Currently, the group consists of 6 members: Bobby, Jay, JUNE, Song, DK, and Chan, after B.I left the group on June 12th, 2019. Known for their energetic performances and diverse music style blending hip-hop, R&B, and pop, iKON has garnered a strong following both domestically and internationally. With hits like 'Love Scenario,' 'Rhythm Ta,' and 'Dive,' iKON has become known for their charismatic stage presence and relatable lyrics",
    "genre": "Kpop",
    "slug": "ikon"
  },
  {
    "name": "Infinite",
    "members": ["Sungkyu", "Dongwoo", "Woohyun", "Sungyeol", "L", "Sungjong"],
    "logoCredits": "INFINITE. Credit: Woollim Entertainment - Source: The Kraze Magazine, https://thekrazemag.com/latest-updates/2022/4/24/history-of-k-pop-infinite#google_vignette",
    "logo": "https://images.squarespace-cdn.com/content/v1/56eb012f27d4bd29de975fae/1650724289411-7Q06289DTJ30O0ON7ZXD/HOK_INFINITE_HEADER.jpg?format=1500w",
    "bio": "INFINITE is a South Korean boy group formed by Woollim Entertainment in 2010. Renowned for their synchronized choreography, powerful vocals, and innovative music, the group quickly rose to prominence with hits like Be Mine and The Chaser. Comprising members Sungkyu, Dongwoo, Woohyun, Sungyeol, L, and Sungjong, INFINITE has left an indelible mark on the K-pop scene with their distinct sound and captivating performances. Their unwavering popularity and influence have solidified their status as one of the iconic groups in the industry",
    "genre": "Kpop",
    "slug": "infinite"
  },
  {
    "name": "Itzy",
    "members": ["Yeji", "Lia", "Ryujin", "Chaeryeong", "Yuna"],
    "logoCredits": "ITZY in a concept photo for their sixth EP, Cheshire. Credit: JYP Entertainment - Source: Grazia Singapore, https://grazia.sg/celebrity/all-five-itzy-members-open-up-individual-instagram-accounts/",
    "logo": "https://graziasg.s3.ap-southeast-1.amazonaws.com/wp-content/uploads/2024/02/ITZY_HallyuSG_Cheshire-Concept-Photo.jpg",
    "bio": "ITZY is a South Korean girl group formed by JYP Entertainment in 2019. Comprising five members – Yeji, Lia, Ryujin, Chaeryeong, and Yuna – ITZY burst onto the K-pop scene with their debut single Dalla Dalla. Known for their powerful performances, bold fashion sense, and empowering messages, ITZY has quickly become a force to be reckoned with in the industry. With chart-topping hits like ICY and WANNABE, the group has captured the hearts of fans worldwide and continues to make waves with their energetic music and dynamic stage presence",
    "genre": "Kpop",
    "slug": "itzy"
  },
  {
    "name": "Ive",
    "members": ["Wonyoung", "Yujin", "Lucy", "Rei", "Liz"],
    "logoCredits": "AYSIA MAROTTA - Source: USA Today, https://eu.usatoday.com/story/entertainment/music/2024/03/12/ive-kpop-group-profile-interview-us-tour/72163811007/",
    "logo": "https://www.gannett-cdn.com/authoring/authoring-images/2024/02/26/USAT/72746758007-wide-use-am-082423-ive-canon-400-hires.jpg?crop=5009,2819,x0,y260&width=960",
    "bio": "IVE is a South Korean girl group formed by Starship Entertainment. Comprising of five members - Wonyoung, Yujin, Lucy, Rei, and Liz - IVE made their highly anticipated debut in 2021 with their first single album Eleven. Known for their powerful vocals, captivating performances, and chic visuals, IVE quickly garnered attention and acclaim from fans and critics alike. With their fresh and dynamic approach to music and performance, IVE aims to make a lasting impact in the K-pop industry",
    "genre": "Kpop",
    "slug": "ive"
  },
  {
    "name": "Kep1er",
    "members": ["Hikaru", "Yeseo", "Dayeon", "Xiaoting", "Chaehyun", "Yujin", "Bahiyyih", "Youngeun", "Mashiro"],
    "logoCredits": "WAKEONE and SWING Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/kep1er-on-first-impact-girls-planet-999-whats-next-interview",
    "logo": "https://assets.teenvogue.com/photos/620696f58519748febbe9d69/1:1/w_960,c_limit/케플러%20단체%20컨셉포토%20ver.1%20로고.jpg",
    "bio": "Kep1er is a South Korean girl group formed by Play M Entertainment through the survival show Girls Planet 999. Consisting of nine members - Geumhee, Léa, Mashiro, Suyoon, Juri, Doyeon, Huening Bahiyyih, Hikaru, and Lily, Kep1er made their debut in 2021 with their first single album FIRST IMPACT. Known for their diverse talents, dynamic performances, and vibrant energy, Kep1er aims to bring a fresh and innovative sound to the K-pop scene. With their international appeal and strong fanbase, Kep1er is poised to make a significant impact in the industry",
    "genre": "Kpop",
    "slug": "kep1er"
  },
  {
    "name": "Le sserafim",
    "members": ["Kazuha", "Yunjin", "Sakura", "Chaewon", "Eunchae"],
    "logoCredits": "LE SSERAFIM. SOURCE MUSIC - Source: Billboard, https://www.billboard.com/music/pop/le-sserafim-kpop-star-profile-1235310295/",
    "logo": "https://www.billboard.com/wp-content/uploads/2023/04/LE-SSERAFIM-press-credit-SOURCE-MUSIC-2023-billboard-exclusive-1548.jpg?w=942&h=623&crop=1",
    "bio": "Le Sserafim, a South Korean girl group under Source Music, debuted on May 2, 2022, with Fearless, breaking records for first-day sales. Their subsequent EP, Antifragile, surpassed a million copies sold, making them the fastest K-pop girl group to debut on the US Billboard 200. Their first studio album, Unforgiven (2023), topped charts, and their third EP, Easys (2024), earned them another number-one spot in South Korea and a top-ten position on the Billboard 200, with its title track marking their debut on the US Billboard Hot 100",
    "genre": "Kpop",
    "slug": "le-sserafim"
  },
  {
    "name": "Mamamoo",
    "members": ["Moonbyu", "Solar", "Wheein", "Hwasa"],
    "logoCredits": "MAMAMOO, 'Yes I Am' concept photo. RBW Entertainment - Source: Billboard, https://www.billboard.com/pro/mamamoo-purple-yes-i-am-first-no-1-world-albums-chart/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/MAMAMOO-yes-i-am-MV-screenshot-2017-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Mamamoo is a South Korean girl group formed by RBW (formerly WA Entertainment) in 2014. Comprising four members - Solar, Moonbyul, Wheein, and Hwasa - Mamamoo is renowned for their powerful vocals, charismatic performances, and versatile music style encompassing genres like R&B, jazz, and retro pop. With hits like Um Oh Ah Yeh and Starry Night, Mamamoo has cemented their position as one of the leading vocal groups in the K-pop industry, known for their strong stage presence and dynamic harmonies",
    "genre": "Kpop",
    "slug": "mamamoo"
  },
  {
    "name": "Monsta X",
    "members": ["Joohoney", "I.M", "Hyungwon", "Kihyun", "Shownu", "Minhyuk"],
    "logoCredits": "EPIC RECORDS - Source: Rolling Stone, https://www.rollingstone.com/music/music-news/monsta-x-you-cant-hold-my-heart-986443/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2020/04/monsta-x-members.png?w=624&h=502&crop=1",
    "bio": "Monsta X is a South Korean boy group formed by Starship Entertainment through the reality survival program No.Mercy in 2015. Consisting of members Shownu, Minhyuk, Kihyun, Hyungwon, Joohoney, and I.M, Monsta X is renowned for their powerful performances, dynamic choreography, and diverse music style blending hip-hop, EDM, and pop. With hits like Hero and Shoot Out, Monsta X has established themselves as global stars, gaining a dedicated fanbase known as Monbebe. They have achieved success both domestically and internationally, earning accolades for their music and electrifying stage presence",
    "genre": "Kpop",
    "slug": "monsta-x"
  },
  {
    "name": "Nct 127",
    "members": ["Johnny", "Haechan", "Mark", "Winwin", "Taeyong", "Jaehyun", "Yuta", "Taeil", "Jungwoo", "Doyoung"],
    "logoCredits": "NCT 127. SM Entertainment - Source: NME, https://www.nme.com/reviews/nct-127-sticker-review-3049921",
    "logo": "https://www.nme.com/wp-content/uploads/2021/09/nct-127-sticker-review-092021-1392x884.jpg",
    "bio": "NCT 127 is a sub-unit of the South Korean boy group NCT, formed by SM Entertainment in 2016. Comprising of members Taeyong, Taeil, Johnny, Yuta, Doyoung, Jaehyun, Jungwoo, Mark, Haechan, and Winwin, NCT 127 is known for their dynamic performances, genre-bending music, and energetic stage presence. With hits like Cherry Bomb and Kick It, they have garnered international recognition, solidifying their status as one of the leading acts in the global K-pop scene. NCT 127's diverse lineup and innovative concepts have earned them a dedicated fanbase known as NCTzens, further propelling their success both domestically and internationally",
    "genre": "Kpop",
    "slug": "nct-127"
  },
  {
    "name": "Nct Dream",
    "members": ["Renjun", "Haechan”, “Mark”, “Chenle”, “Jisung”, “Jaemin”, “Jeno"],
    "logoCredits": "NCT Dream. SM Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/nct-dream-interview-new-album-glitch-mode-1332855/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2022/04/nct-dream-2022-credit-sm-entertainment.jpg?w=1581&h=1054&crop=1",
    "bio": "NCT Dream is a sub-unit of the South Korean boy group NCT, formed by SM Entertainment in 2016. Comprising of members Mark, Renjun, Jeno, Haechan, Jaemin, Chenle, and Jisung, NCT Dream initially debuted as a rotational unit for teenage members but later transitioned into a fixed unit. Known for their youthful energy, catchy music, and synchronized choreography, NCT Dream has captivated audiences with hits like Chewing Gum and We Go Up. With their dynamic performances and relatable lyrics, they have amassed a dedicated fanbase known as NCTzens, solidifying their position as one of the prominent acts in the K-pop industry",
    "genre": "Kpop",
    "slug": "nct-dream"
  },
  {
    "name": "NewJeans",
    "members": ["Hanni", "Danielle", "Minji", "Hyein", "Haerin"],
    "logoCredits": "ADOR - Source: Grammy, https://www.grammy.com/news/newjeans-kpop-interview-ep-get-up-videos",
    "logo": "https://i8.amplience.net/i/naras/NewJeans_ADOR",
    "bio": "NewJeans is a South Korean girl group formed by ADOR. Comprising Minji, Hanni, Danielle, Haerin, and Hyein, they debuted in July 2022 with the single Attention, topping South Korea's Circle Digital Chart. Their subsequent releases, including Hype Boy and Cookie, further solidified their success. With their nostalgic sound and catchy tunes, NewJeans continues to rise as a promising presence in the K-pop scene",
    "genre": "Kpop",
    "slug": "newjeans"
  },
  {
    "name": "Nmixx",
    "members": ["Bae", "Jiwoo", "Sullyoon", "Kyujin", "Haewon", "Lily"],
    "logoCredits": "JYP Entertainment - Source: NME, https://www.nme.com/features/music-interviews/nmixx-polarising-mixx-pop-sound-fe3o4-break-dash-interview-3571458",
    "logo": "https://www.nme.com/wp-content/uploads/2024/01/nmixx-fe3o5-break-jyp-ent-image2-1392x884.jpg",
    "bio": "Nmixx is a South Korean girl group formed by SQU4D, a sub-label of JYP Entertainment. Comprising six members - Lily, Haewon, Sullyoon, Bae, Jiwoo, and Kyujin - Nmixx debuted on February 22, 2022, with the single album Ad Mare. Originally a seven-piece group, Jinni departed from the lineup on December 9, 2022, for personal reasons. The name Nmixx signifies a blend of now, new, next, and the unknown n, along with mix, symbolizing diversity and combination, representing the group's aim to be the best combination for a new era",
    "genre": "Kpop",
    "slug": "nmixx"
  },
  {
    "name": "Oneus",
    "members": ["Seoho", "Leedo", "Keonhee", "Hwanwoong", "Xion"],
    "logoCredits": "RBW Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/oneus-reach-for-us-tour-interview",
    "logo": "https://assets.teenvogue.com/photos/63d929447e922ab0f3b6d095/1:1/w_960,c_limit/%5BONEUS%5D%20단체1.jpg",
    "bio": "Oneus is a South Korean boy group formed by RBW Entertainment. Comprising of members Ravn, Seoho, Leedo, Keonhee, Hwanwoong, and Xion, Oneus debuted in 2019 with their single album Light Us. Known for their powerful performances, intricate choreography, and diverse music style blending elements of pop, rock, and hip-hop, Oneus has quickly gained recognition in the K-pop industry. With hits like Valkyrie and Lit, they have established themselves as rising stars, captivating audiences with their charisma and talent. As versatile performers and musicians, Oneus continues to evolve and leave a lasting impact on the global music scene",
    "genre": "Kpop",
    "slug": "oneus"
  },
  {
    "name": "Red velvet",
    "members": ["Joy", "Yeri", "Irene", "Seulgi", "Wendy"],
    "logoCredits": "Red Velvet. SM Entertainment - Source: NME, https://www.nme.com/news/music/red-velvet-comeback-full-group-august-confirmed-2964342",
    "logo": "https://www.nme.com/wp-content/uploads/2021/06/redvelvet-psycho-2019-1392x884.jpg",
    "bio": "Red Velvet is a South Korean girl group formed by SM Entertainment. Comprising of members Irene, Seulgi, Wendy, Joy, and Yeri, Red Velvet debuted in 2014 with the digital single Happiness. Known for their versatile music style, which encompasses genres like pop, R&B, and electronic, Red Velvet has become one of the leading acts in the K-pop industry. With iconic hits such as Red Flavor and Psycho, they have garnered widespread acclaim and a dedicated fanbase known as ReVeluvs. Renowned for their captivating performances and unique concepts, Red Velvet continues to set trends and inspire fans worldwide.",
    "genre": "Kpop",
    "slug": "red-velvet"
  },
  {
    "name": "STAYC",
    "members": ["Seeun", "J", "Sieun", "Sumin", "Yoon", "Isa"],
    "logoCredits": "High Up Entertainment - Source: NME, https://www.nme.com/news/music/stayc-comeback-teenfresh-3472355",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/stayc-high-up-entertainment-160823-1392x884.jpg",
    "bio": "Stayc is a South Korean girl group formed by High Up Entertainment. Comprising of members Sumin, Sieun, Isa, Seeun, Yoon, and J, Stayc debuted in 2020 with their single album Star To A Young Culture. Known for their powerful vocals, captivating performances, and fresh concept, Stayc has quickly gained attention in the K-pop industry. With hits like So Bad and ASAP, they have showcased their talent and charisma, earning recognition from fans and critics alike. Stayc continues to impress with their dynamic music and vibrant energy, establishing themselves as a promising presence in the global music scene",
    "genre": "Kpop",
    "slug": "stayc"
  },
  {
    "name": "Seventeen",
    "members": ["Woozi", "Seungkwan", "Mingyu", "Jeonghan", "Vernon", "Hoshi", "The8", "Dino", "Joshua", "DK", "Jun", "Wonwoo", "S.Coups"],
    "logoCredits": "Pledis Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/seventeen-follow-again-tour-maestro-video-1235009208/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2024/04/seventeen-lead.jpg?w=1581&h=1054&crop=1",
    "bio": "Seventeen is a South Korean boy group formed by Pledis Entertainment. Consisting of thirteen members - S.Coups, Jeonghan, Joshua, Jun, Hoshi, Wonwoo, Woozi, DK, Mingyu, The8, Seungkwan, Vernon, and Dino - Seventeen debuted in 2015 with their first extended play 17 Carat. Known for their self-producing abilities, intricate choreography, and diverse music style spanning genres like pop, hip-hop, and R&B, Seventeen has gained recognition as one of the most talented and innovative groups in the K-pop industry. With chart-topping hits such as Clap and Left & Right, they have established a strong fanbase known as Carats. As versatile performers and prolific songwriters, Seventeen continues to captivate audiences worldwide with their dynamic performances and heartfelt music",
    "genre": "Kpop",
    "slug": "seventeen"
  },
  {
    "name": "Shinee",
    "members": ["Key", "Onew", "Minho", "Taemin"],
    "logoCredits": "SHINee. SM Entertainment - Source: NME, https://www.nme.com/reviews/album/shinee-hard-review-3464947",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/shinee-hard-review-696x442.jpg",
    "bio": "SHINee is a South Korean boy group formed by SM Entertainment. Consisting of members Onew, Key, Minho, and Taemin, SHINee debuted in 2008 with their single album Replay. Renowned for their unique sound, intricate choreography, and experimental music style that blends pop, R&B, and electronic elements, SHINee quickly rose to fame and became known as the Princes of K-pop. With iconic hits such as Ring Ding Dong and Lucifer, they have established themselves as one of the most influential and acclaimed groups in the industry. Known for their versatility and artistic depth, SHINee continues to push boundaries and inspire fans worldwide with their music and performances",
    "genre": "Kpop",
    "slug": "shinee"
  },
  {
    "name": "Stray kids",
    "members": ["Felix", "Changbin", "Lee Know", "Han", "Seungmin", "I.N", "Bang Chan", "Hyunjin"],
    "logoCredits": "Universal Music Group - Source: The New York Times, https://www.nytimes.com/2022/03/29/arts/music/stray-kids-k-pop-billboard-chart.html",
    "logo": "https://static01.nyt.com/images/2022/03/30/arts/28billboard-item/28billboard-item-superJumbo.jpg?quality=75&auto=webp",
    "bio": "Stray Kids is a South Korean boy group formed by JYP Entertainment through the reality show Stray Kids. Comprising of members Bang Chan, Lee Know, Changbin, Hyunjin, Han, Felix, Seungmin, and I.N, Stray Kids debuted in 2018 with their extended play I Am NOT. Known for their powerful performances, introspective lyrics, and unique blend of hip-hop, EDM, and rock, Stray Kids has quickly risen to prominence in the K-pop industry. With hits like God's Menu and Back Door, they have garnered a dedicated fanbase known as Stay. Renowned for their self-produced music and dynamic stage presence, Stray Kids continues to push boundaries and make their mark as one of the most innovative groups in K-pop",
    "genre": "Kpop",
    "slug": "stray-kids"
  },
  {
    "name": "Super junior",
    "members": ["Leeteuk", "Heechul", "Yesung", "Shindong", "Sungmin", "Eunhyuk", "Siwon", "Donghae", "Ryeowook", "Kyuhyun"],
    "logoCredits": "SM Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/k-pop-super-junior-new-album-1156702/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2021/04/super-junior.jpg?w=1581&h=1054&crop=1",
    "bio": "Super Junior is a South Korean boy group formed by SM Entertainment. Initially debuting as a twelve-member group in 2005, Super Junior has become one of the most iconic and influential groups in the K-pop industry. Comprising of members Leeteuk, Heechul, Yesung, Shindong, Eunhyuk, Siwon, Donghae, Ryeowook, and Kyuhyun, Super Junior is known for their diverse music style, captivating performances, and strong vocal and dance abilities. With hits like Sorry, Sorry and Mr. Simple, they have achieved immense success both domestically and internationally, earning numerous awards and accolades. Despite lineup changes and military enlistments, Super Junior remains a powerhouse in the industry, continuing to delight fans with their music, variety show appearances, and global tours",
    "genre": "Kpop",
    "slug": "super-junior"
  },
  {
    "name": "Treasure",
    "members": ["Park Jeong-woo", "Haruto", "Jihoon", "Yoshi", "So Jung-hwan", "Junkyu", "Doyoung", "Yoon Jae-hyuk", "Choi Hyun-suk", "Asahi"],
    "logoCredits": "TREASURE. YG Entertainment - Source: NME, https://www.nme.com/features/music-interviews/a-year-in-review-treasure-look-back-on-2023-3566037",
    "logo": "https://www.nme.com/wp-content/uploads/2024/01/treasure-eoy-interview-image2-1392x885.jpg",
    "bio": "TREASURE is a South Korean boy group formed by YG Entertainment through the reality survival program YG Treasure Box. Comprising of members Hyunsuk, Jihoon, Yoshi, Junkyu, Mashiho, Jaehyuk, Asahi, Yedam, Doyoung, Haruto, Jeongwoo, and Junghwan, TREASURE debuted in 2020 with their single album The First Step: Chapter One. Known for their energetic performances, catchy music, and diverse talents, TREASURE has quickly gained popularity in the K-pop industry. With hits like Boy and My Treasure, they have captured the hearts of fans worldwide.",
    "genre": "Kpop",
    "slug": "treasure"
  },
  {
    "name": "Twice",
    "members": ["Tzuyu", "Nayeon", "Jihyo", "Dahyun", "Momo", "Sana", "Jeongyeon", "Mina", "Chaeyoung"],
    "logoCredits": "Twice. JYP Entertainment - Source: Billboard, https://www.billboard.com/music/pop/twices-talk-prioritizing-mental-health-stadiums-touring-1235613483/",
    "logo": "https://www.billboard.com/wp-content/uploads/2024/02/TWICE-2024-press-01-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Twice is a South Korean girl group formed by JYP Entertainment through the reality show Sixteen. Comprising of members Nayeon, Jeongyeon, Momo, Sana, Jihyo, Mina, Dahyun, Chaeyoung, and Tzuyu, Twice debuted in 2015 with their mini-album The Story Begins. Known for their catchy melodies, vibrant performances, and charming personalities, Twice has become one of the most popular and influential girl groups in the K-pop industry. With chart-topping hits like Cheer Up and TT, they have achieved immense success both in South Korea and internationally, earning numerous awards and accolades",
    "genre": "Kpop",
    "slug": "twice"
  },
  {
    "name": "Tomorrow X Together",
    "members": ["Soobin", "HueningKai", "Beomgyu", "Yeonjun", "Taehyun"],
    "logoCredits": "Tomorrow X Together. HYBE Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/tomorrow-x-together-playlist-takeover-tuesday-8544184/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/06-TOMORROW-X-TOGETHER-press-2019-cr-Big-Hit-Entertainment-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Tomorrow X Together, also known as TXT, is a South Korean boy band formed by HYBE Corporation. Comprised of members Soobin, Yeonjun, Beomgyu, Taehyun, and Huening Kai, TXT debuted in 2019 with their EP The Dream Chapter: Star. Known for their youthful energy, vibrant music, and intricate choreography, TXT quickly gained popularity in the K-pop scene. With hits like Crown and Run Away, they have established themselves as one of the leading fourth-generation K-pop groups. TXT continues to evolve their sound and style, captivating audiences worldwide with their talent and creativity",
    "genre": "Kpop",
    "slug": "tomorrow-x-together"
  },
  {
    "name": "Kiss of life",
    "members": ["Belle", "Natty", "Julie", "Haneul"],
    "logoCredits": "KISS OF LIFE. S2 Entertainment - Source: NME, https://www.nme.com/news/music/kiss-of-life-debut-ep-shhh-music-video-release-3465470",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/kiss-of-life-s2-entertainment-060723-1392x884.jpg",
    "bio": "Kiss of Life is a South Korean girl group formed by S2 Entertainment in 2023. Comprising of members Julie, Natty, Belle, and Haneul, they debuted on July 5, 2023, with their EP Kiss of Life. With their vibrant energy and captivating performances, Kiss of Life aims to leave a lasting impression in the K-pop industry",
    "genre": "Kpop",
    "slug": "kiss-of-life"
  },
  {
    "name": "Illit",
    "members": ["Minju", "Iroha", "Wonhee", "Moka", "Yunah"],
    "logoCredits": "ILLIT. BELIFT LAB - Source: Forbes, https://www.forbes.com/sites/jeffbenjamin/2024/03/31/illit-enter-k-pop-world-with-unprecedented-magnetic-debut-single/",
    "logo": "https://imageio.forbes.com/specials-images/imageserve/660a2cdc41fe75f40b573b06/ILLIT-K-pop-girl-group-concept-photo-for--SUPER-ME---courtesy-of-BELIFT-LAB/0x0.jpg?format=jpg&crop=3000,2000,x0,y0,safe&width=960",
    "bio": "Illit is a South Korean girl group formed by Belift Lab, a sub-label of HYBE, through the JTBC 2023 survival competition show R U Next?. Comprising of members Yunah, Minju, Moka, Wonhee, and Iroha, they debuted on March 25, 2024, with their EP Super Real Me. With their diverse talents and unique charm, Illit aims to make their mark in the K-pop industry.",
    "genre": "Kpop",
    "slug": "illit"
  },
  {
    "name": "Baby “monster",
    "members": ["Asa", "Ruka", "Ahyeon", "Pharita", "Chiquita", "Rami", "Rora"],
    "logoCredits": "YG Entertainment - Source: Soompi, https://www.soompi.com/article/1647669wpp/watch-babymonster-drops-visual-film-for-7-member-comeback-with-ahyeon",
    "logo": "https://6.soompi.io/wp-content/uploads/image/20240315151537_babymonster_6ba081.jpeg?s=900x600&e=t",
    "bio": "Baby Monster is a South Korean girl group formed by YG Entertainment through Last Evaluation (2023). Comprising of seven members - Ruka, Pharita, Asa, Ahyeon, Rami, Rora, and Chiquita, the ensemble officially debuted on April 1, 2024, with their eponymous first extended play (EP) BabyMons7er. With their diverse talents and unique charm, Baby Monster aims to carve out their own space in the K-pop industry",
    "genre": "Kpop",
    "slug": "baby-monster"
  },
  {
    "name": "Aespa",
    "members": ["Karina", "Giselle", "Winter", "Ningning"],
    "genre": "Kpop",
    "logoCredits": "Aespa. Credit: SM Entertainment - Source: NME, https://www.nme.com/news/music/aespa-reveal-girls-was-supposed-to-be-released-a-lot-earlier-3263683",
    "logo": "https://www.nme.com/wp-content/uploads/2022/07/aespa-girls-concept-photo-released-later.jpg",
    "bio": "Aespa is a South Korean girl group formed by SM Entertainment in 2020. The group consists of four members: Karina, Giselle, Winter, and Ningning. Debuting with their single 'Black Mamba,' aespa quickly gained attention for their innovative concept, which blends the virtual world with reality through their virtual avatars. Their music is characterized by a mix of various genres, including pop, hip-hop, and electronic elements. With their mesmerizing performances, captivating visuals, and unique concept, aespa has rapidly become one of the most talked-about acts in the K-pop scene",
    "slug": "aespa"
  },
  {
    "name": "Ateez",
    "members": ["Hongjoong", "Seonghwa", "Yunho", "Yeosang", "San", "Mingi", "Wooyoung", "Jongho"],

    "logoCredits": "ATEEZ. Credit: KQ ENTERTAINMENT - Source: Forbes, https://www.forbes.com/sites/jeffbenjamin/2021/03/31/ateez-discuss-the-confidence--creative-motivations-behind-zero--fever-part2-album/",
    "logo": "https://imageio.forbes.com/specials-images/imageserve/60643c7a2a2850f86ecb16e2/KQ-Entertainment-K-pop-boy-band-ATEEZ--Zero--Fever-Part-2--6th-mini-album-group-photo/0x0.jpg?format=jpg&crop=2716,1810,x0,y0,safe&width=960",
    "bio": "ATEEZ is a South Korean boy group formed by KQ Entertainment in 2018. Comprising eight members - Hongjoong, Seonghwa, Yunho, Yeosang, San, Mingi, Wooyoung, and Jongho - ATEEZ quickly made their mark in the K-pop industry with their powerful performances, intricate choreography, and distinctive musical style that blends elements of EDM, hip-hop, and rock. Debuting with their EP 'Treasure EP.1: All to Zero,' they have since released multiple successful albums, earning them a dedicated international fanbase known as ATINY. ATEEZ is known for their adventurous and dynamic concepts, often drawing inspiration from exploration and adventure themes. Their passion, energy, and talent have solidified their position as one of the leading acts in the global K-pop scene",
    "genre": "Kpop",
    "slug": "ateez"
  },
  {
    "name": "Blackpink",
    "members": ["Jisoo", "Jennie", "Rosé", "Lisa"],
    "genre": "Kpop",
    "logoCredits": "BLACKPINK. Credit: YG Entertainment - Source: NME, https://www.nme.com/news/music/blackpink-shut-down-title-track-born-pink-album-3305618",
    "logo": "https://www.nme.com/wp-content/uploads/2022/09/blackpink-title-track-shut-down-born-pink-album-announcement.jpg",
    "bio": "BLACKPINK is a South Korean girl group formed by YG Entertainment in 2016. Consisting of four members - Jisoo, Jennie, Rosé, and Lisa - BLACKPINK quickly rose to fame with their powerful performances, catchy music, and captivating visuals. Debuting with the single album 'Square One,' they garnered widespread attention for their distinct blend of pop, hip-hop, and EDM, coupled with fierce choreography. BLACKPINK has broken numerous records, including being the first K-pop girl group to perform at Coachella and the first to reach one billion views on YouTube for their music video 'DDU-DU DDU-DU.' With their global appeal, fashion-forward image, and chart-topping hits, BLACKPINK has solidified their status as one of the most influential and iconic girl groups in the world",
    "slug": "blackpink"
  },
  {
    "name": "BTS",
    "members": ["Jin", "Suga", "J-Hope", "RM", "Jimin", "V", "Jungkook"],
    "logoCredits": "By Dawbell/Big Hit - Source: Metro, https://metro.co.uk/2018/08/16/bts-drop-second-round-concept-images-love-answer-7848633/",
    "logo": "https://metro.co.uk/wp-content/uploads/2018/08/1_f_bts-d924.jpg?quality=90&strip=all",
    "bio": "BTS, also known as the Bangtan Boys, is a South Korean boy band formed by Big Hit Entertainment in 2013. Consisting of seven members - RM, Jin, Suga, J-Hope, Jimin, V, and Jungkook - BTS has taken the world by storm with their powerful music, socially conscious lyrics, and mesmerizing performances. Debuting with the single album '2 Cool 4 Skool,' they've since achieved unprecedented success, breaking numerous records and earning a dedicated global fanbase known as the ARMY. BTS has been recognized for their influence on music, culture, and philanthropy, becoming one of the most influential and acclaimed boy bands in the world",
    "genre": "Kpop",
    "slug": "bts"
  },
  {
    "name": "The Boyz",
    "members": ["Sangyeon", "Jacob", "Younghoon", "Hyunjae", "Juyeon", "Kevin", "New", "Q", "Haknyeon", "Sunwoo", "Eric"],
    "logoCredits": "THE BOYZ official FB page - Source: HallyuSG, https://www.hallyusg.net/2019/05/16/feature-theboyz/",
    "logo": "https://www.hallyusg.net/wp-content/uploads/2019/05/theboyz.jpg",
    "bio": "THE BOYZ is a South Korean boy group formed by Cre.Ker Entertainment in 2017. Comprising eleven members - Sangyeon, Jacob, Younghoon, Hyunjae, Juyeon, Kevin, New, Q, Juhaknyeon, Sunwoo, and Eric - THE BOYZ has garnered attention for their energetic performances, diverse talents, and vibrant personalities. Debuting with the mini-album 'The First,' they quickly gained popularity with their catchy music and captivating stage presence. With a growing international fanbase, THE BOYZ continues to showcase their versatility and charm, solidifying their position as rising stars in the K-pop industry.",
    "genre": "Kpop",
    "slug": "the-boyz"
  },
  {
    "name": "Exo",
    "members": ["Xiumin", "Baekhyun", "Chen", "Lay", "Sehun", "Chanyeol", "D.O.", "Kai", "Suho"],
    "logoCredits": "EXO. Credit: SM Entertainment - Source: The Bias List, https://thebiaslist.com/2018/12/13/song-review-exo-love-shot/",
    "logo": "https://thebiaslist.com/wp-content/uploads/2018/12/EXO-Love-Shot.jpg",
    "bio": "EXO is a South Korean-Chinese boy group formed by SM Entertainment in 2012. Initially consisting of twelve members, the group is now composed of nine members: Xiumin, Suho, Lay, Baekhyun, Chen, Chanyeol, D.O., Kai, and Sehun. Known for their powerful vocals, intricate choreography, and diverse music style that spans from pop to R&B and hip-hop, EXO has become one of the most influential and successful K-pop acts globally. Debuting with the single 'Mama,' they've released numerous hit albums and singles, earned numerous awards, and sold out concerts worldwide. With a dedicated fanbase known as EXO-Ls, EXO continues to make waves in the music industry",
    "genre": "Kpop",
    "slug": "exo"
  },
  {
    "name": "Enhypen",
    "members": ["Sunghoon", "Sunoo", "Jungwon", "Ni-ki", "Heeseung", "Jay", "Jake"],
    "logoCredits": "Pak Bae for NME - Source: NME, https://www.nme.com/news/music/enhypen-the-cover-playlist-3466672",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/Enhypen-2023-Credit-Pak-Bae@2000x1270-1392x884.jpg",
    "bio": "ENHYPEN is a South Korean boy group formed by Belift Lab through the survival show 'I-LAND' in 2020. Consisting of seven members - Jungwon, Heeseung, Jay, Jake, Sunghoon, Sunoo, and Ni-ki - ENHYPEN quickly gained attention for their exceptional talent, versatility, and captivating performances. Debuting with the mini-album 'BORDER: DAY ONE,' they showcased their dynamic music style, blending elements of pop, hip-hop, and EDM. With their strong visuals, synchronized choreography, and engaging music, ENHYPEN has rapidly emerged as one of the most promising acts in the K-pop industry, capturing the hearts of fans globally",
    "genre": "Kpop",
    "slug": "enhypen"
  },
  {
    "name": "Everglow",
    "members": ["E:U", "Onda", "Yiren", "Sihyeon", "Mia", "Aisha"],
    "logoCredits": "Yuehua Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/everglow-kpop-group-interview",
    "logo": "https://assets.teenvogue.com/photos/60b9272bfb7e96265602da59/1:1/w_960,c_limit/everglow02.jpeg",
    "bio": "EVERGLOW is a South Korean girl group formed by Yuehua Entertainment in 2019. Comprising six members - E:U, Sihyeon, Mia, Onda, Aisha, and Yiren - EVERGLOW quickly made an impact with their powerful performances, catchy music, and striking visuals. Debuting with the single album 'Arrival of Everglow,' they gained attention for their dynamic choreography and diverse music style, incorporating elements of pop, EDM, and hip-hop. With their charismatic stage presence and energetic performances, EVERGLOW has garnered a dedicated international fanbase and continues to shine as one of the rising stars in the K-pop scene.",
    "genre": "Kpop",
    "slug": "everglow"
  },

  {
    "name": "(G)I-DLE",
    "members": ["Minnie", "Miyeon", "Soyeon", "Yuqi", "Shuhua"],
    "logoCredits": "CUBE ENTERTAINMENT - Source: Uproxx, https://uproxx.com/pop/gidle-nxde-top-40-radio-charts/",
    "logo": "https://uproxx.com/wp-content/uploads/2023/01/GIDLE-N-710.jpg?w=640",
    "bio": "(G)I-DLE is a South Korean girl group formed by CUBE Entertainment in 2018. Consisting of six members - Miyeon, Minnie, Soyeon, Soojin, Yuqi, and Shuhua - (G)I-DLE quickly gained attention for their unique sound, bold concepts, and charismatic performances. Debuting with the single 'LATATA,' they showcased their versatility by blending various genres such as pop, hip-hop, and EDM. With their empowering lyrics and captivating stage presence, (G)I-DLE has earned acclaim both domestically and internationally, becoming known for their innovation and creativity in the K-pop industry",
    "genre": "Kpop",
    "slug": "g-idle"
  },
  {
    "name": "Girls Generation",
    "members": ["Sunny", "Tiffany", "Hyoyeon", "Yoona", "Seohyun", "Yuri", "Taeyeon", "Sooyoung"],
    "logoCredits": "Girls' Generation. Credit: SM Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/girls-generation-decade-10-years-k-pop-fans-interview-7934088/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/girls-generation-holiday-night-billboard-1548.jpg",
    "bio": "Girls' Generation, also known as SNSD, is a legendary South Korean girl group formed by SM Entertainment in 2007. Consisting of members Taeyeon, Sunny, Tiffany, Hyoyeon, Yuri, Sooyoung, Yoona, and Seohyun, Girls' Generation quickly rose to fame with their infectious pop anthems, impeccable choreography, and charismatic performances. Debuting with the single 'Into the New World,' they became one of the pioneering acts in the Hallyu wave, spreading K-pop's popularity globally. With numerous hits like 'Gee,' 'Genie,' and 'I Got a Boy,' Girls' Generation has solidified their status as one of the most iconic and influential girl groups in the history of K-pop",
    "genre": "Kpop",
    "slug": "girls-generation"
  },
  {
    "name": "Got7",
    "members": ["Mark", "Jay B", "Jackson", "Jinyoung", "Youngjae", "BamBam", "Yugyeom"],
    "logoCredits": "JYP Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/a-look-back-at-got7s-career-from-their-electrifying-debut-to-stadium-concerts-9324104/",
    "logo": "https://www.billboard.com/wp-content/uploads/2020/02/GOT7-press-photo-2020-billboard-1548-1582816394.jpg",
    "bio": "GOT7 is a South Korean boy group formed by JYP Entertainment in 2014. Comprising seven members - JB, Mark, Jackson, Jinyoung, Youngjae, BamBam, and Yugyeom - GOT7 quickly gained recognition for their energetic performances, strong vocals, and diverse music style. Debuting with the single 'Girls Girls Girls,' they showcased their versatility with a blend of pop, hip-hop, and R&B influences. With chart-topping hits like 'Just Right,' 'Hard Carry,' and 'Lullaby,' GOT7 has become known for their global appeal, captivating fans around the world with their infectious music and engaging personalities. In 2021, the group decided to depart from JYP Entertainment after seven years, but their legacy in the K-pop industry remains significant.",
    "genre": "Kpop",
    "slug": "got7"
  },
  {
    "name": "Ikon",
    "members": ["Song", "DK", "Jay", "Chan", "Bobby", "Ju-ne"],
    "logoCredits": "143 Entertainment - Source: Soompi, https://www.soompi.com/article/1585029wpp/ikon-tops-itunes-charts-around-the-world-with-take-off",
    "logo": "https://6.soompi.io/wp-content/uploads/image/20230424093735_ikon-1-5.jpeg?s=900x600&e=t",
    "bio": "iKON is a South Korean boy group under 143 Entertainment. Formed from the survival show Mix & Match by YG entertainment, iKON debuted in 2015 with seven members. Currently, the group consists of 6 members: Bobby, Jay, JUNE, Song, DK, and Chan, after B.I left the group on June 12th, 2019. Known for their energetic performances and diverse music style blending hip-hop, R&B, and pop, iKON has garnered a strong following both domestically and internationally. With hits like 'Love Scenario,' 'Rhythm Ta,' and 'Dive,' iKON has become known for their charismatic stage presence and relatable lyrics",
    "genre": "Kpop",
    "slug": "ikon"
  },
  {
    "name": "Infinite",
    "members": ["Sungkyu", "Dongwoo", "Woohyun", "Sungyeol", "L", "Sungjong"],
    "logoCredits": "INFINITE. Credit: Woollim Entertainment - Source: The Kraze Magazine, https://thekrazemag.com/latest-updates/2022/4/24/history-of-k-pop-infinite#google_vignette",
    "logo": "https://images.squarespace-cdn.com/content/v1/56eb012f27d4bd29de975fae/1650724289411-7Q06289DTJ30O0ON7ZXD/HOK_INFINITE_HEADER.jpg?format=1500w",
    "bio": "INFINITE is a South Korean boy group formed by Woollim Entertainment in 2010. Renowned for their synchronized choreography, powerful vocals, and innovative music, the group quickly rose to prominence with hits like Be Mine and The Chaser. Comprising members Sungkyu, Dongwoo, Woohyun, Sungyeol, L, and Sungjong, INFINITE has left an indelible mark on the K-pop scene with their distinct sound and captivating performances. Their unwavering popularity and influence have solidified their status as one of the iconic groups in the industry",
    "genre": "Kpop",
    "slug": "infinite"
  },
  {
    "name": "Itzy",
    "members": ["Yeji", "Lia", "Ryujin", "Chaeryeong", "Yuna"],
    "logoCredits": "ITZY in a concept photo for their sixth EP, Cheshire. Credit: JYP Entertainment - Source: Grazia Singapore, https://grazia.sg/celebrity/all-five-itzy-members-open-up-individual-instagram-accounts/",
    "logo": "https://graziasg.s3.ap-southeast-1.amazonaws.com/wp-content/uploads/2024/02/ITZY_HallyuSG_Cheshire-Concept-Photo.jpg",
    "bio": "ITZY is a South Korean girl group formed by JYP Entertainment in 2019. Comprising five members – Yeji, Lia, Ryujin, Chaeryeong, and Yuna – ITZY burst onto the K-pop scene with their debut single Dalla Dalla. Known for their powerful performances, bold fashion sense, and empowering messages, ITZY has quickly become a force to be reckoned with in the industry. With chart-topping hits like ICY and WANNABE, the group has captured the hearts of fans worldwide and continues to make waves with their energetic music and dynamic stage presence",
    "genre": "Kpop",
    "slug": "itzy"
  },
  {
    "name": "Ive",
    "members": ["Wonyoung", "Yujin", "Lucy", "Rei", "Liz"],
    "logoCredits": "AYSIA MAROTTA - Source: USA Today, https://eu.usatoday.com/story/entertainment/music/2024/03/12/ive-kpop-group-profile-interview-us-tour/72163811007/",
    "logo": "https://www.gannett-cdn.com/authoring/authoring-images/2024/02/26/USAT/72746758007-wide-use-am-082423-ive-canon-400-hires.jpg?crop=5009,2819,x0,y260&width=960",
    "bio": "IVE is a South Korean girl group formed by Starship Entertainment. Comprising of five members - Wonyoung, Yujin, Lucy, Rei, and Liz - IVE made their highly anticipated debut in 2021 with their first single album Eleven. Known for their powerful vocals, captivating performances, and chic visuals, IVE quickly garnered attention and acclaim from fans and critics alike. With their fresh and dynamic approach to music and performance, IVE aims to make a lasting impact in the K-pop industry",
    "genre": "Kpop",
    "slug": "ive"
  },
  {
    "name": "Kep1er",
    "members": ["Hikaru", "Yeseo", "Dayeon", "Xiaoting", "Chaehyun", "Yujin", "Bahiyyih", "Youngeun", "Mashiro"],
    "logoCredits": "WAKEONE and SWING Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/kep1er-on-first-impact-girls-planet-999-whats-next-interview",
    "logo": "https://assets.teenvogue.com/photos/620696f58519748febbe9d69/1:1/w_960,c_limit/케플러%20단체%20컨셉포토%20ver.1%20로고.jpg",
    "bio": "Kep1er is a South Korean girl group formed by Play M Entertainment through the survival show Girls Planet 999. Consisting of nine members - Geumhee, Léa, Mashiro, Suyoon, Juri, Doyeon, Huening Bahiyyih, Hikaru, and Lily, Kep1er made their debut in 2021 with their first single album FIRST IMPACT. Known for their diverse talents, dynamic performances, and vibrant energy, Kep1er aims to bring a fresh and innovative sound to the K-pop scene. With their international appeal and strong fanbase, Kep1er is poised to make a significant impact in the industry",
    "genre": "Kpop",
    "slug": "kep1er"
  },
  {
    "name": "Le sserafim",
    "members": ["Kazuha", "Yunjin", "Sakura", "Chaewon", "Eunchae"],
    "logoCredits": "LE SSERAFIM. SOURCE MUSIC - Source: Billboard, https://www.billboard.com/music/pop/le-sserafim-kpop-star-profile-1235310295/",
    "logo": "https://www.billboard.com/wp-content/uploads/2023/04/LE-SSERAFIM-press-credit-SOURCE-MUSIC-2023-billboard-exclusive-1548.jpg?w=942&h=623&crop=1",
    "bio": "Le Sserafim, a South Korean girl group under Source Music, debuted on May 2, 2022, with Fearless, breaking records for first-day sales. Their subsequent EP, Antifragile, surpassed a million copies sold, making them the fastest K-pop girl group to debut on the US Billboard 200. Their first studio album, Unforgiven (2023), topped charts, and their third EP, Easys (2024), earned them another number-one spot in South Korea and a top-ten position on the Billboard 200, with its title track marking their debut on the US Billboard Hot 100",
    "genre": "Kpop",
    "slug": "le-sserafim"
  },
  {
    "name": "Mamamoo",
    "members": ["Moonbyu", "Solar", "Wheein", "Hwasa"],
    "logoCredits": "MAMAMOO, 'Yes I Am' concept photo. RBW Entertainment - Source: Billboard, https://www.billboard.com/pro/mamamoo-purple-yes-i-am-first-no-1-world-albums-chart/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/MAMAMOO-yes-i-am-MV-screenshot-2017-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Mamamoo is a South Korean girl group formed by RBW (formerly WA Entertainment) in 2014. Comprising four members - Solar, Moonbyul, Wheein, and Hwasa - Mamamoo is renowned for their powerful vocals, charismatic performances, and versatile music style encompassing genres like R&B, jazz, and retro pop. With hits like Um Oh Ah Yeh and Starry Night, Mamamoo has cemented their position as one of the leading vocal groups in the K-pop industry, known for their strong stage presence and dynamic harmonies",
    "genre": "Kpop",
    "slug": "mamamoo"
  },
  {
    "name": "Monsta X",
    "members": ["Joohoney", "I.M", "Hyungwon", "Kihyun", "Shownu", "Minhyuk"],
    "logoCredits": "EPIC RECORDS - Source: Rolling Stone, https://www.rollingstone.com/music/music-news/monsta-x-you-cant-hold-my-heart-986443/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2020/04/monsta-x-members.png?w=624&h=502&crop=1",
    "bio": "Monsta X is a South Korean boy group formed by Starship Entertainment through the reality survival program No.Mercy in 2015. Consisting of members Shownu, Minhyuk, Kihyun, Hyungwon, Joohoney, and I.M, Monsta X is renowned for their powerful performances, dynamic choreography, and diverse music style blending hip-hop, EDM, and pop. With hits like Hero and Shoot Out, Monsta X has established themselves as global stars, gaining a dedicated fanbase known as Monbebe. They have achieved success both domestically and internationally, earning accolades for their music and electrifying stage presence",
    "genre": "Kpop",
    "slug": "monsta-x"
  },
  {
    "name": "Nct 127",
    "members": ["Johnny", "Haechan", "Mark", "Winwin", "Taeyong", "Jaehyun", "Yuta", "Taeil", "Jungwoo", "Doyoung"],
    "logoCredits": "NCT 127. SM Entertainment - Source: NME, https://www.nme.com/reviews/nct-127-sticker-review-3049921",
    "logo": "https://www.nme.com/wp-content/uploads/2021/09/nct-127-sticker-review-092021-1392x884.jpg",
    "bio": "NCT 127 is a sub-unit of the South Korean boy group NCT, formed by SM Entertainment in 2016. Comprising of members Taeyong, Taeil, Johnny, Yuta, Doyoung, Jaehyun, Jungwoo, Mark, Haechan, and Winwin, NCT 127 is known for their dynamic performances, genre-bending music, and energetic stage presence. With hits like Cherry Bomb and Kick It, they have garnered international recognition, solidifying their status as one of the leading acts in the global K-pop scene. NCT 127's diverse lineup and innovative concepts have earned them a dedicated fanbase known as NCTzens, further propelling their success both domestically and internationally",
    "genre": "Kpop",
    "slug": "nct-127"
  },
  {
    "name": "Nct Dream",
    "members": ["Renjun", "Haechan”, “Mark”, “Chenle”, “Jisung”, “Jaemin”, “Jeno"],
    "logoCredits": "NCT Dream. SM Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/nct-dream-interview-new-album-glitch-mode-1332855/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2022/04/nct-dream-2022-credit-sm-entertainment.jpg?w=1581&h=1054&crop=1",
    "bio": "NCT Dream is a sub-unit of the South Korean boy group NCT, formed by SM Entertainment in 2016. Comprising of members Mark, Renjun, Jeno, Haechan, Jaemin, Chenle, and Jisung, NCT Dream initially debuted as a rotational unit for teenage members but later transitioned into a fixed unit. Known for their youthful energy, catchy music, and synchronized choreography, NCT Dream has captivated audiences with hits like Chewing Gum and We Go Up. With their dynamic performances and relatable lyrics, they have amassed a dedicated fanbase known as NCTzens, solidifying their position as one of the prominent acts in the K-pop industry",
    "genre": "Kpop",
    "slug": "nct-dream"
  },
  {
    "name": "NewJeans",
    "members": ["Hanni", "Danielle", "Minji", "Hyein", "Haerin"],
    "logoCredits": "ADOR - Source: Grammy, https://www.grammy.com/news/newjeans-kpop-interview-ep-get-up-videos",
    "logo": "https://i8.amplience.net/i/naras/NewJeans_ADOR",
    "bio": "NewJeans is a South Korean girl group formed by ADOR. Comprising Minji, Hanni, Danielle, Haerin, and Hyein, they debuted in July 2022 with the single Attention, topping South Korea's Circle Digital Chart. Their subsequent releases, including Hype Boy and Cookie, further solidified their success. With their nostalgic sound and catchy tunes, NewJeans continues to rise as a promising presence in the K-pop scene",
    "genre": "Kpop",
    "slug": "newjeans"
  },
  {
    "name": "Nmixx",
    "members": ["Bae", "Jiwoo", "Sullyoon", "Kyujin", "Haewon", "Lily"],
    "logoCredits": "JYP Entertainment - Source: NME, https://www.nme.com/features/music-interviews/nmixx-polarising-mixx-pop-sound-fe3o4-break-dash-interview-3571458",
    "logo": "https://www.nme.com/wp-content/uploads/2024/01/nmixx-fe3o5-break-jyp-ent-image2-1392x884.jpg",
    "bio": "Nmixx is a South Korean girl group formed by SQU4D, a sub-label of JYP Entertainment. Comprising six members - Lily, Haewon, Sullyoon, Bae, Jiwoo, and Kyujin - Nmixx debuted on February 22, 2022, with the single album Ad Mare. Originally a seven-piece group, Jinni departed from the lineup on December 9, 2022, for personal reasons. The name Nmixx signifies a blend of now, new, next, and the unknown n, along with mix, symbolizing diversity and combination, representing the group's aim to be the best combination for a new era",
    "genre": "Kpop",
    "slug": "nmixx"
  },
  {
    "name": "Oneus",
    "members": ["Seoho", "Leedo", "Keonhee", "Hwanwoong", "Xion"],
    "logoCredits": "RBW Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/oneus-reach-for-us-tour-interview",
    "logo": "https://assets.teenvogue.com/photos/63d929447e922ab0f3b6d095/1:1/w_960,c_limit/%5BONEUS%5D%20단체1.jpg",
    "bio": "Oneus is a South Korean boy group formed by RBW Entertainment. Comprising of members Ravn, Seoho, Leedo, Keonhee, Hwanwoong, and Xion, Oneus debuted in 2019 with their single album Light Us. Known for their powerful performances, intricate choreography, and diverse music style blending elements of pop, rock, and hip-hop, Oneus has quickly gained recognition in the K-pop industry. With hits like Valkyrie and Lit, they have established themselves as rising stars, captivating audiences with their charisma and talent. As versatile performers and musicians, Oneus continues to evolve and leave a lasting impact on the global music scene",
    "genre": "Kpop",
    "slug": "oneus"
  },
  {
    "name": "Red velvet",
    "members": ["Joy", "Yeri", "Irene", "Seulgi", "Wendy"],
    "logoCredits": "Red Velvet. SM Entertainment - Source: NME, https://www.nme.com/news/music/red-velvet-comeback-full-group-august-confirmed-2964342",
    "logo": "https://www.nme.com/wp-content/uploads/2021/06/redvelvet-psycho-2019-1392x884.jpg",
    "bio": "Red Velvet is a South Korean girl group formed by SM Entertainment. Comprising of members Irene, Seulgi, Wendy, Joy, and Yeri, Red Velvet debuted in 2014 with the digital single Happiness. Known for their versatile music style, which encompasses genres like pop, R&B, and electronic, Red Velvet has become one of the leading acts in the K-pop industry. With iconic hits such as Red Flavor and Psycho, they have garnered widespread acclaim and a dedicated fanbase known as ReVeluvs. Renowned for their captivating performances and unique concepts, Red Velvet continues to set trends and inspire fans worldwide.",
    "genre": "Kpop",
    "slug": "red-velvet"
  },
  {
    "name": "STAYC",
    "members": ["Seeun", "J", "Sieun", "Sumin", "Yoon", "Isa"],
    "logoCredits": "High Up Entertainment - Source: NME, https://www.nme.com/news/music/stayc-comeback-teenfresh-3472355",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/stayc-high-up-entertainment-160823-1392x884.jpg",
    "bio": "Stayc is a South Korean girl group formed by High Up Entertainment. Comprising of members Sumin, Sieun, Isa, Seeun, Yoon, and J, Stayc debuted in 2020 with their single album Star To A Young Culture. Known for their powerful vocals, captivating performances, and fresh concept, Stayc has quickly gained attention in the K-pop industry. With hits like So Bad and ASAP, they have showcased their talent and charisma, earning recognition from fans and critics alike. Stayc continues to impress with their dynamic music and vibrant energy, establishing themselves as a promising presence in the global music scene",
    "genre": "Kpop",
    "slug": "stayc"
  },
  {
    "name": "Seventeen",
    "members": ["Woozi", "Seungkwan", "Mingyu", "Jeonghan", "Vernon", "Hoshi", "The8", "Dino", "Joshua", "DK", "Jun", "Wonwoo", "S.Coups"],
    "logoCredits": "Pledis Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/seventeen-follow-again-tour-maestro-video-1235009208/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2024/04/seventeen-lead.jpg?w=1581&h=1054&crop=1",
    "bio": "Seventeen is a South Korean boy group formed by Pledis Entertainment. Consisting of thirteen members - S.Coups, Jeonghan, Joshua, Jun, Hoshi, Wonwoo, Woozi, DK, Mingyu, The8, Seungkwan, Vernon, and Dino - Seventeen debuted in 2015 with their first extended play 17 Carat. Known for their self-producing abilities, intricate choreography, and diverse music style spanning genres like pop, hip-hop, and R&B, Seventeen has gained recognition as one of the most talented and innovative groups in the K-pop industry. With chart-topping hits such as Clap and Left & Right, they have established a strong fanbase known as Carats. As versatile performers and prolific songwriters, Seventeen continues to captivate audiences worldwide with their dynamic performances and heartfelt music",
    "genre": "Kpop",
    "slug": "seventeen"
  },
  {
    "name": "Shinee",
    "members": ["Key", "Onew", "Minho", "Taemin"],
    "logoCredits": "SHINee. SM Entertainment - Source: NME, https://www.nme.com/reviews/album/shinee-hard-review-3464947",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/shinee-hard-review-696x442.jpg",
    "bio": "SHINee is a South Korean boy group formed by SM Entertainment. Consisting of members Onew, Key, Minho, and Taemin, SHINee debuted in 2008 with their single album Replay. Renowned for their unique sound, intricate choreography, and experimental music style that blends pop, R&B, and electronic elements, SHINee quickly rose to fame and became known as the Princes of K-pop. With iconic hits such as Ring Ding Dong and Lucifer, they have established themselves as one of the most influential and acclaimed groups in the industry. Known for their versatility and artistic depth, SHINee continues to push boundaries and inspire fans worldwide with their music and performances",
    "genre": "Kpop",
    "slug": "shinee"
  },
  {
    "name": "Stray kids",
    "members": ["Felix", "Changbin", "Lee Know", "Han", "Seungmin", "I.N", "Bang Chan", "Hyunjin"],
    "logoCredits": "Universal Music Group - Source: The New York Times, https://www.nytimes.com/2022/03/29/arts/music/stray-kids-k-pop-billboard-chart.html",
    "logo": "https://static01.nyt.com/images/2022/03/30/arts/28billboard-item/28billboard-item-superJumbo.jpg?quality=75&auto=webp",
    "bio": "Stray Kids is a South Korean boy group formed by JYP Entertainment through the reality show Stray Kids. Comprising of members Bang Chan, Lee Know, Changbin, Hyunjin, Han, Felix, Seungmin, and I.N, Stray Kids debuted in 2018 with their extended play I Am NOT. Known for their powerful performances, introspective lyrics, and unique blend of hip-hop, EDM, and rock, Stray Kids has quickly risen to prominence in the K-pop industry. With hits like God's Menu and Back Door, they have garnered a dedicated fanbase known as Stay. Renowned for their self-produced music and dynamic stage presence, Stray Kids continues to push boundaries and make their mark as one of the most innovative groups in K-pop",
    "genre": "Kpop",
    "slug": "stray-kids"
  },
  {
    "name": "Super junior",
    "members": ["Leeteuk", "Heechul", "Yesung", "Shindong", "Sungmin", "Eunhyuk", "Siwon", "Donghae", "Ryeowook", "Kyuhyun"],
    "logoCredits": "SM Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/k-pop-super-junior-new-album-1156702/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2021/04/super-junior.jpg?w=1581&h=1054&crop=1",
    "bio": "Super Junior is a South Korean boy group formed by SM Entertainment. Initially debuting as a twelve-member group in 2005, Super Junior has become one of the most iconic and influential groups in the K-pop industry. Comprising of members Leeteuk, Heechul, Yesung, Shindong, Eunhyuk, Siwon, Donghae, Ryeowook, and Kyuhyun, Super Junior is known for their diverse music style, captivating performances, and strong vocal and dance abilities. With hits like Sorry, Sorry and Mr. Simple, they have achieved immense success both domestically and internationally, earning numerous awards and accolades. Despite lineup changes and military enlistments, Super Junior remains a powerhouse in the industry, continuing to delight fans with their music, variety show appearances, and global tours",
    "genre": "Kpop",
    "slug": "super-junior"
  },
  {
    "name": "Treasure",
    "members": ["Park Jeong-woo", "Haruto", "Jihoon", "Yoshi", "So Jung-hwan", "Junkyu", "Doyoung", "Yoon Jae-hyuk", "Choi Hyun-suk", "Asahi"],
    "logoCredits": "TREASURE. YG Entertainment - Source: NME, https://www.nme.com/features/music-interviews/a-year-in-review-treasure-look-back-on-2023-3566037",
    "logo": "https://www.nme.com/wp-content/uploads/2024/01/treasure-eoy-interview-image2-1392x885.jpg",
    "bio": "TREASURE is a South Korean boy group formed by YG Entertainment through the reality survival program YG Treasure Box. Comprising of members Hyunsuk, Jihoon, Yoshi, Junkyu, Mashiho, Jaehyuk, Asahi, Yedam, Doyoung, Haruto, Jeongwoo, and Junghwan, TREASURE debuted in 2020 with their single album The First Step: Chapter One. Known for their energetic performances, catchy music, and diverse talents, TREASURE has quickly gained popularity in the K-pop industry. With hits like Boy and My Treasure, they have captured the hearts of fans worldwide.",
    "genre": "Kpop",
    "slug": "treasure"
  },
  {
    "name": "Twice",
    "members": ["Tzuyu", "Nayeon", "Jihyo", "Dahyun", "Momo", "Sana", "Jeongyeon", "Mina", "Chaeyoung"],
    "logoCredits": "Twice. JYP Entertainment - Source: Billboard, https://www.billboard.com/music/pop/twices-talk-prioritizing-mental-health-stadiums-touring-1235613483/",
    "logo": "https://www.billboard.com/wp-content/uploads/2024/02/TWICE-2024-press-01-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Twice is a South Korean girl group formed by JYP Entertainment through the reality show Sixteen. Comprising of members Nayeon, Jeongyeon, Momo, Sana, Jihyo, Mina, Dahyun, Chaeyoung, and Tzuyu, Twice debuted in 2015 with their mini-album The Story Begins. Known for their catchy melodies, vibrant performances, and charming personalities, Twice has become one of the most popular and influential girl groups in the K-pop industry. With chart-topping hits like Cheer Up and TT, they have achieved immense success both in South Korea and internationally, earning numerous awards and accolades",
    "genre": "Kpop",
    "slug": "twice"
  },
  {
    "name": "Tomorrow X Together",
    "members": ["Soobin", "HueningKai", "Beomgyu", "Yeonjun", "Taehyun"],
    "logoCredits": "Tomorrow X Together. HYBE Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/tomorrow-x-together-playlist-takeover-tuesday-8544184/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/06-TOMORROW-X-TOGETHER-press-2019-cr-Big-Hit-Entertainment-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Tomorrow X Together, also known as TXT, is a South Korean boy band formed by HYBE Corporation. Comprised of members Soobin, Yeonjun, Beomgyu, Taehyun, and Huening Kai, TXT debuted in 2019 with their EP The Dream Chapter: Star. Known for their youthful energy, vibrant music, and intricate choreography, TXT quickly gained popularity in the K-pop scene. With hits like Crown and Run Away, they have established themselves as one of the leading fourth-generation K-pop groups. TXT continues to evolve their sound and style, captivating audiences worldwide with their talent and creativity",
    "genre": "Kpop",
    "slug": "tomorrow-x-together"
  },
  {
    "name": "Kiss of life",
    "members": ["Belle", "Natty", "Julie", "Haneul"],
    "logoCredits": "KISS OF LIFE. S2 Entertainment - Source: NME, https://www.nme.com/news/music/kiss-of-life-debut-ep-shhh-music-video-release-3465470",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/kiss-of-life-s2-entertainment-060723-1392x884.jpg",
    "bio": "Kiss of Life is a South Korean girl group formed by S2 Entertainment in 2023. Comprising of members Julie, Natty, Belle, and Haneul, they debuted on July 5, 2023, with their EP Kiss of Life. With their vibrant energy and captivating performances, Kiss of Life aims to leave a lasting impression in the K-pop industry",
    "genre": "Kpop",
    "slug": "kiss-of-life"
  },
  {
    "name": "Illit",
    "members": ["Minju", "Iroha", "Wonhee", "Moka", "Yunah"],
    "logoCredits": "ILLIT. BELIFT LAB - Source: Forbes, https://www.forbes.com/sites/jeffbenjamin/2024/03/31/illit-enter-k-pop-world-with-unprecedented-magnetic-debut-single/",
    "logo": "https://imageio.forbes.com/specials-images/imageserve/660a2cdc41fe75f40b573b06/ILLIT-K-pop-girl-group-concept-photo-for--SUPER-ME---courtesy-of-BELIFT-LAB/0x0.jpg?format=jpg&crop=3000,2000,x0,y0,safe&width=960",
    "bio": "Illit is a South Korean girl group formed by Belift Lab, a sub-label of HYBE, through the JTBC 2023 survival competition show R U Next?. Comprising of members Yunah, Minju, Moka, Wonhee, and Iroha, they debuted on March 25, 2024, with their EP Super Real Me. With their diverse talents and unique charm, Illit aims to make their mark in the K-pop industry.",
    "genre": "Kpop",
    "slug": "illit"
  },
  {
    "name": "Baby “monster",
    "members": ["Asa", "Ruka", "Ahyeon", "Pharita", "Chiquita", "Rami", "Rora"],
    "logoCredits": "YG Entertainment - Source: Soompi, https://www.soompi.com/article/1647669wpp/watch-babymonster-drops-visual-film-for-7-member-comeback-with-ahyeon",
    "logo": "https://6.soompi.io/wp-content/uploads/image/20240315151537_babymonster_6ba081.jpeg?s=900x600&e=t",
    "bio": "Baby Monster is a South Korean girl group formed by YG Entertainment through Last Evaluation (2023). Comprising of seven members - Ruka, Pharita, Asa, Ahyeon, Rami, Rora, and Chiquita, the ensemble officially debuted on April 1, 2024, with their eponymous first extended play (EP) BabyMons7er. With their diverse talents and unique charm, Baby Monster aims to carve out their own space in the K-pop industry",
    "genre": "Kpop",
    "slug": "baby-monster"
  },
  {
    "name": "Aespa",
    "members": ["Karina", "Giselle", "Winter", "Ningning"],
    "genre": "Kpop",
    "logoCredits": "Aespa. Credit: SM Entertainment - Source: NME, https://www.nme.com/news/music/aespa-reveal-girls-was-supposed-to-be-released-a-lot-earlier-3263683",
    "logo": "https://www.nme.com/wp-content/uploads/2022/07/aespa-girls-concept-photo-released-later.jpg",
    "bio": "Aespa is a South Korean girl group formed by SM Entertainment in 2020. The group consists of four members: Karina, Giselle, Winter, and Ningning. Debuting with their single 'Black Mamba,' aespa quickly gained attention for their innovative concept, which blends the virtual world with reality through their virtual avatars. Their music is characterized by a mix of various genres, including pop, hip-hop, and electronic elements. With their mesmerizing performances, captivating visuals, and unique concept, aespa has rapidly become one of the most talked-about acts in the K-pop scene",
    "slug": "aespa"
  },
  {
    "name": "Ateez",
    "members": ["Hongjoong", "Seonghwa", "Yunho", "Yeosang", "San", "Mingi", "Wooyoung", "Jongho"],

    "logoCredits": "ATEEZ. Credit: KQ ENTERTAINMENT - Source: Forbes, https://www.forbes.com/sites/jeffbenjamin/2021/03/31/ateez-discuss-the-confidence--creative-motivations-behind-zero--fever-part2-album/",
    "logo": "https://imageio.forbes.com/specials-images/imageserve/60643c7a2a2850f86ecb16e2/KQ-Entertainment-K-pop-boy-band-ATEEZ--Zero--Fever-Part-2--6th-mini-album-group-photo/0x0.jpg?format=jpg&crop=2716,1810,x0,y0,safe&width=960",
    "bio": "ATEEZ is a South Korean boy group formed by KQ Entertainment in 2018. Comprising eight members - Hongjoong, Seonghwa, Yunho, Yeosang, San, Mingi, Wooyoung, and Jongho - ATEEZ quickly made their mark in the K-pop industry with their powerful performances, intricate choreography, and distinctive musical style that blends elements of EDM, hip-hop, and rock. Debuting with their EP 'Treasure EP.1: All to Zero,' they have since released multiple successful albums, earning them a dedicated international fanbase known as ATINY. ATEEZ is known for their adventurous and dynamic concepts, often drawing inspiration from exploration and adventure themes. Their passion, energy, and talent have solidified their position as one of the leading acts in the global K-pop scene",
    "genre": "Kpop",
    "slug": "ateez"
  },
  {
    "name": "Blackpink",
    "members": ["Jisoo", "Jennie", "Rosé", "Lisa"],
    "genre": "Kpop",
    "logoCredits": "BLACKPINK. Credit: YG Entertainment - Source: NME, https://www.nme.com/news/music/blackpink-shut-down-title-track-born-pink-album-3305618",
    "logo": "https://www.nme.com/wp-content/uploads/2022/09/blackpink-title-track-shut-down-born-pink-album-announcement.jpg",
    "bio": "BLACKPINK is a South Korean girl group formed by YG Entertainment in 2016. Consisting of four members - Jisoo, Jennie, Rosé, and Lisa - BLACKPINK quickly rose to fame with their powerful performances, catchy music, and captivating visuals. Debuting with the single album 'Square One,' they garnered widespread attention for their distinct blend of pop, hip-hop, and EDM, coupled with fierce choreography. BLACKPINK has broken numerous records, including being the first K-pop girl group to perform at Coachella and the first to reach one billion views on YouTube for their music video 'DDU-DU DDU-DU.' With their global appeal, fashion-forward image, and chart-topping hits, BLACKPINK has solidified their status as one of the most influential and iconic girl groups in the world",
    "slug": "blackpink"
  },
  {
    "name": "BTS",
    "members": ["Jin", "Suga", "J-Hope", "RM", "Jimin", "V", "Jungkook"],
    "logoCredits": "By Dawbell/Big Hit - Source: Metro, https://metro.co.uk/2018/08/16/bts-drop-second-round-concept-images-love-answer-7848633/",
    "logo": "https://metro.co.uk/wp-content/uploads/2018/08/1_f_bts-d924.jpg?quality=90&strip=all",
    "bio": "BTS, also known as the Bangtan Boys, is a South Korean boy band formed by Big Hit Entertainment in 2013. Consisting of seven members - RM, Jin, Suga, J-Hope, Jimin, V, and Jungkook - BTS has taken the world by storm with their powerful music, socially conscious lyrics, and mesmerizing performances. Debuting with the single album '2 Cool 4 Skool,' they've since achieved unprecedented success, breaking numerous records and earning a dedicated global fanbase known as the ARMY. BTS has been recognized for their influence on music, culture, and philanthropy, becoming one of the most influential and acclaimed boy bands in the world",
    "genre": "Kpop",
    "slug": "bts"
  },
  {
    "name": "The Boyz",
    "members": ["Sangyeon", "Jacob", "Younghoon", "Hyunjae", "Juyeon", "Kevin", "New", "Q", "Haknyeon", "Sunwoo", "Eric"],
    "logoCredits": "THE BOYZ official FB page - Source: HallyuSG, https://www.hallyusg.net/2019/05/16/feature-theboyz/",
    "logo": "https://www.hallyusg.net/wp-content/uploads/2019/05/theboyz.jpg",
    "bio": "THE BOYZ is a South Korean boy group formed by Cre.Ker Entertainment in 2017. Comprising eleven members - Sangyeon, Jacob, Younghoon, Hyunjae, Juyeon, Kevin, New, Q, Juhaknyeon, Sunwoo, and Eric - THE BOYZ has garnered attention for their energetic performances, diverse talents, and vibrant personalities. Debuting with the mini-album 'The First,' they quickly gained popularity with their catchy music and captivating stage presence. With a growing international fanbase, THE BOYZ continues to showcase their versatility and charm, solidifying their position as rising stars in the K-pop industry.",
    "genre": "Kpop",
    "slug": "the-boyz"
  },
  {
    "name": "Exo",
    "members": ["Xiumin", "Baekhyun", "Chen", "Lay", "Sehun", "Chanyeol", "D.O.", "Kai", "Suho"],
    "logoCredits": "EXO. Credit: SM Entertainment - Source: The Bias List, https://thebiaslist.com/2018/12/13/song-review-exo-love-shot/",
    "logo": "https://thebiaslist.com/wp-content/uploads/2018/12/EXO-Love-Shot.jpg",
    "bio": "EXO is a South Korean-Chinese boy group formed by SM Entertainment in 2012. Initially consisting of twelve members, the group is now composed of nine members: Xiumin, Suho, Lay, Baekhyun, Chen, Chanyeol, D.O., Kai, and Sehun. Known for their powerful vocals, intricate choreography, and diverse music style that spans from pop to R&B and hip-hop, EXO has become one of the most influential and successful K-pop acts globally. Debuting with the single 'Mama,' they've released numerous hit albums and singles, earned numerous awards, and sold out concerts worldwide. With a dedicated fanbase known as EXO-Ls, EXO continues to make waves in the music industry",
    "genre": "Kpop",
    "slug": "exo"
  },
  {
    "name": "Enhypen",
    "members": ["Sunghoon", "Sunoo", "Jungwon", "Ni-ki", "Heeseung", "Jay", "Jake"],
    "logoCredits": "Pak Bae for NME - Source: NME, https://www.nme.com/news/music/enhypen-the-cover-playlist-3466672",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/Enhypen-2023-Credit-Pak-Bae@2000x1270-1392x884.jpg",
    "bio": "ENHYPEN is a South Korean boy group formed by Belift Lab through the survival show 'I-LAND' in 2020. Consisting of seven members - Jungwon, Heeseung, Jay, Jake, Sunghoon, Sunoo, and Ni-ki - ENHYPEN quickly gained attention for their exceptional talent, versatility, and captivating performances. Debuting with the mini-album 'BORDER: DAY ONE,' they showcased their dynamic music style, blending elements of pop, hip-hop, and EDM. With their strong visuals, synchronized choreography, and engaging music, ENHYPEN has rapidly emerged as one of the most promising acts in the K-pop industry, capturing the hearts of fans globally",
    "genre": "Kpop",
    "slug": "enhypen"
  },
  {
    "name": "Everglow",
    "members": ["E:U", "Onda", "Yiren", "Sihyeon", "Mia", "Aisha"],
    "logoCredits": "Yuehua Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/everglow-kpop-group-interview",
    "logo": "https://assets.teenvogue.com/photos/60b9272bfb7e96265602da59/1:1/w_960,c_limit/everglow02.jpeg",
    "bio": "EVERGLOW is a South Korean girl group formed by Yuehua Entertainment in 2019. Comprising six members - E:U, Sihyeon, Mia, Onda, Aisha, and Yiren - EVERGLOW quickly made an impact with their powerful performances, catchy music, and striking visuals. Debuting with the single album 'Arrival of Everglow,' they gained attention for their dynamic choreography and diverse music style, incorporating elements of pop, EDM, and hip-hop. With their charismatic stage presence and energetic performances, EVERGLOW has garnered a dedicated international fanbase and continues to shine as one of the rising stars in the K-pop scene.",
    "genre": "Kpop",
    "slug": "everglow"
  },

  {
    "name": "(G)I-DLE",
    "members": ["Minnie", "Miyeon", "Soyeon", "Yuqi", "Shuhua"],
    "logoCredits": "CUBE ENTERTAINMENT - Source: Uproxx, https://uproxx.com/pop/gidle-nxde-top-40-radio-charts/",
    "logo": "https://uproxx.com/wp-content/uploads/2023/01/GIDLE-N-710.jpg?w=640",
    "bio": "(G)I-DLE is a South Korean girl group formed by CUBE Entertainment in 2018. Consisting of six members - Miyeon, Minnie, Soyeon, Soojin, Yuqi, and Shuhua - (G)I-DLE quickly gained attention for their unique sound, bold concepts, and charismatic performances. Debuting with the single 'LATATA,' they showcased their versatility by blending various genres such as pop, hip-hop, and EDM. With their empowering lyrics and captivating stage presence, (G)I-DLE has earned acclaim both domestically and internationally, becoming known for their innovation and creativity in the K-pop industry",
    "genre": "Kpop",
    "slug": "g-idle"
  },
  {
    "name": "Girls Generation",
    "members": ["Sunny", "Tiffany", "Hyoyeon", "Yoona", "Seohyun", "Yuri", "Taeyeon", "Sooyoung"],
    "logoCredits": "Girls' Generation. Credit: SM Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/girls-generation-decade-10-years-k-pop-fans-interview-7934088/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/girls-generation-holiday-night-billboard-1548.jpg",
    "bio": "Girls' Generation, also known as SNSD, is a legendary South Korean girl group formed by SM Entertainment in 2007. Consisting of members Taeyeon, Sunny, Tiffany, Hyoyeon, Yuri, Sooyoung, Yoona, and Seohyun, Girls' Generation quickly rose to fame with their infectious pop anthems, impeccable choreography, and charismatic performances. Debuting with the single 'Into the New World,' they became one of the pioneering acts in the Hallyu wave, spreading K-pop's popularity globally. With numerous hits like 'Gee,' 'Genie,' and 'I Got a Boy,' Girls' Generation has solidified their status as one of the most iconic and influential girl groups in the history of K-pop",
    "genre": "Kpop",
    "slug": "girls-generation"
  },
  {
    "name": "Got7",
    "members": ["Mark", "Jay B", "Jackson", "Jinyoung", "Youngjae", "BamBam", "Yugyeom"],
    "logoCredits": "JYP Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/a-look-back-at-got7s-career-from-their-electrifying-debut-to-stadium-concerts-9324104/",
    "logo": "https://www.billboard.com/wp-content/uploads/2020/02/GOT7-press-photo-2020-billboard-1548-1582816394.jpg",
    "bio": "GOT7 is a South Korean boy group formed by JYP Entertainment in 2014. Comprising seven members - JB, Mark, Jackson, Jinyoung, Youngjae, BamBam, and Yugyeom - GOT7 quickly gained recognition for their energetic performances, strong vocals, and diverse music style. Debuting with the single 'Girls Girls Girls,' they showcased their versatility with a blend of pop, hip-hop, and R&B influences. With chart-topping hits like 'Just Right,' 'Hard Carry,' and 'Lullaby,' GOT7 has become known for their global appeal, captivating fans around the world with their infectious music and engaging personalities. In 2021, the group decided to depart from JYP Entertainment after seven years, but their legacy in the K-pop industry remains significant.",
    "genre": "Kpop",
    "slug": "got7"
  },
  {
    "name": "Ikon",
    "members": ["Song", "DK", "Jay", "Chan", "Bobby", "Ju-ne"],
    "logoCredits": "143 Entertainment - Source: Soompi, https://www.soompi.com/article/1585029wpp/ikon-tops-itunes-charts-around-the-world-with-take-off",
    "logo": "https://6.soompi.io/wp-content/uploads/image/20230424093735_ikon-1-5.jpeg?s=900x600&e=t",
    "bio": "iKON is a South Korean boy group under 143 Entertainment. Formed from the survival show Mix & Match by YG entertainment, iKON debuted in 2015 with seven members. Currently, the group consists of 6 members: Bobby, Jay, JUNE, Song, DK, and Chan, after B.I left the group on June 12th, 2019. Known for their energetic performances and diverse music style blending hip-hop, R&B, and pop, iKON has garnered a strong following both domestically and internationally. With hits like 'Love Scenario,' 'Rhythm Ta,' and 'Dive,' iKON has become known for their charismatic stage presence and relatable lyrics",
    "genre": "Kpop",
    "slug": "ikon"
  },
  {
    "name": "Infinite",
    "members": ["Sungkyu", "Dongwoo", "Woohyun", "Sungyeol", "L", "Sungjong"],
    "logoCredits": "INFINITE. Credit: Woollim Entertainment - Source: The Kraze Magazine, https://thekrazemag.com/latest-updates/2022/4/24/history-of-k-pop-infinite#google_vignette",
    "logo": "https://images.squarespace-cdn.com/content/v1/56eb012f27d4bd29de975fae/1650724289411-7Q06289DTJ30O0ON7ZXD/HOK_INFINITE_HEADER.jpg?format=1500w",
    "bio": "INFINITE is a South Korean boy group formed by Woollim Entertainment in 2010. Renowned for their synchronized choreography, powerful vocals, and innovative music, the group quickly rose to prominence with hits like Be Mine and The Chaser. Comprising members Sungkyu, Dongwoo, Woohyun, Sungyeol, L, and Sungjong, INFINITE has left an indelible mark on the K-pop scene with their distinct sound and captivating performances. Their unwavering popularity and influence have solidified their status as one of the iconic groups in the industry",
    "genre": "Kpop",
    "slug": "infinite"
  },
  {
    "name": "Itzy",
    "members": ["Yeji", "Lia", "Ryujin", "Chaeryeong", "Yuna"],
    "logoCredits": "ITZY in a concept photo for their sixth EP, Cheshire. Credit: JYP Entertainment - Source: Grazia Singapore, https://grazia.sg/celebrity/all-five-itzy-members-open-up-individual-instagram-accounts/",
    "logo": "https://graziasg.s3.ap-southeast-1.amazonaws.com/wp-content/uploads/2024/02/ITZY_HallyuSG_Cheshire-Concept-Photo.jpg",
    "bio": "ITZY is a South Korean girl group formed by JYP Entertainment in 2019. Comprising five members – Yeji, Lia, Ryujin, Chaeryeong, and Yuna – ITZY burst onto the K-pop scene with their debut single Dalla Dalla. Known for their powerful performances, bold fashion sense, and empowering messages, ITZY has quickly become a force to be reckoned with in the industry. With chart-topping hits like ICY and WANNABE, the group has captured the hearts of fans worldwide and continues to make waves with their energetic music and dynamic stage presence",
    "genre": "Kpop",
    "slug": "itzy"
  },
  {
    "name": "Ive",
    "members": ["Wonyoung", "Yujin", "Lucy", "Rei", "Liz"],
    "logoCredits": "AYSIA MAROTTA - Source: USA Today, https://eu.usatoday.com/story/entertainment/music/2024/03/12/ive-kpop-group-profile-interview-us-tour/72163811007/",
    "logo": "https://www.gannett-cdn.com/authoring/authoring-images/2024/02/26/USAT/72746758007-wide-use-am-082423-ive-canon-400-hires.jpg?crop=5009,2819,x0,y260&width=960",
    "bio": "IVE is a South Korean girl group formed by Starship Entertainment. Comprising of five members - Wonyoung, Yujin, Lucy, Rei, and Liz - IVE made their highly anticipated debut in 2021 with their first single album Eleven. Known for their powerful vocals, captivating performances, and chic visuals, IVE quickly garnered attention and acclaim from fans and critics alike. With their fresh and dynamic approach to music and performance, IVE aims to make a lasting impact in the K-pop industry",
    "genre": "Kpop",
    "slug": "ive"
  },
  {
    "name": "Kep1er",
    "members": ["Hikaru", "Yeseo", "Dayeon", "Xiaoting", "Chaehyun", "Yujin", "Bahiyyih", "Youngeun", "Mashiro"],
    "logoCredits": "WAKEONE and SWING Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/kep1er-on-first-impact-girls-planet-999-whats-next-interview",
    "logo": "https://assets.teenvogue.com/photos/620696f58519748febbe9d69/1:1/w_960,c_limit/케플러%20단체%20컨셉포토%20ver.1%20로고.jpg",
    "bio": "Kep1er is a South Korean girl group formed by Play M Entertainment through the survival show Girls Planet 999. Consisting of nine members - Geumhee, Léa, Mashiro, Suyoon, Juri, Doyeon, Huening Bahiyyih, Hikaru, and Lily, Kep1er made their debut in 2021 with their first single album FIRST IMPACT. Known for their diverse talents, dynamic performances, and vibrant energy, Kep1er aims to bring a fresh and innovative sound to the K-pop scene. With their international appeal and strong fanbase, Kep1er is poised to make a significant impact in the industry",
    "genre": "Kpop",
    "slug": "kep1er"
  },
  {
    "name": "Le sserafim",
    "members": ["Kazuha", "Yunjin", "Sakura", "Chaewon", "Eunchae"],
    "logoCredits": "LE SSERAFIM. SOURCE MUSIC - Source: Billboard, https://www.billboard.com/music/pop/le-sserafim-kpop-star-profile-1235310295/",
    "logo": "https://www.billboard.com/wp-content/uploads/2023/04/LE-SSERAFIM-press-credit-SOURCE-MUSIC-2023-billboard-exclusive-1548.jpg?w=942&h=623&crop=1",
    "bio": "Le Sserafim, a South Korean girl group under Source Music, debuted on May 2, 2022, with Fearless, breaking records for first-day sales. Their subsequent EP, Antifragile, surpassed a million copies sold, making them the fastest K-pop girl group to debut on the US Billboard 200. Their first studio album, Unforgiven (2023), topped charts, and their third EP, Easys (2024), earned them another number-one spot in South Korea and a top-ten position on the Billboard 200, with its title track marking their debut on the US Billboard Hot 100",
    "genre": "Kpop",
    "slug": "le-sserafim"
  },
  {
    "name": "Mamamoo",
    "members": ["Moonbyu", "Solar", "Wheein", "Hwasa"],
    "logoCredits": "MAMAMOO, 'Yes I Am' concept photo. RBW Entertainment - Source: Billboard, https://www.billboard.com/pro/mamamoo-purple-yes-i-am-first-no-1-world-albums-chart/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/MAMAMOO-yes-i-am-MV-screenshot-2017-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Mamamoo is a South Korean girl group formed by RBW (formerly WA Entertainment) in 2014. Comprising four members - Solar, Moonbyul, Wheein, and Hwasa - Mamamoo is renowned for their powerful vocals, charismatic performances, and versatile music style encompassing genres like R&B, jazz, and retro pop. With hits like Um Oh Ah Yeh and Starry Night, Mamamoo has cemented their position as one of the leading vocal groups in the K-pop industry, known for their strong stage presence and dynamic harmonies",
    "genre": "Kpop",
    "slug": "mamamoo"
  },
  {
    "name": "Monsta X",
    "members": ["Joohoney", "I.M", "Hyungwon", "Kihyun", "Shownu", "Minhyuk"],
    "logoCredits": "EPIC RECORDS - Source: Rolling Stone, https://www.rollingstone.com/music/music-news/monsta-x-you-cant-hold-my-heart-986443/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2020/04/monsta-x-members.png?w=624&h=502&crop=1",
    "bio": "Monsta X is a South Korean boy group formed by Starship Entertainment through the reality survival program No.Mercy in 2015. Consisting of members Shownu, Minhyuk, Kihyun, Hyungwon, Joohoney, and I.M, Monsta X is renowned for their powerful performances, dynamic choreography, and diverse music style blending hip-hop, EDM, and pop. With hits like Hero and Shoot Out, Monsta X has established themselves as global stars, gaining a dedicated fanbase known as Monbebe. They have achieved success both domestically and internationally, earning accolades for their music and electrifying stage presence",
    "genre": "Kpop",
    "slug": "monsta-x"
  },
  {
    "name": "Nct 127",
    "members": ["Johnny", "Haechan", "Mark", "Winwin", "Taeyong", "Jaehyun", "Yuta", "Taeil", "Jungwoo", "Doyoung"],
    "logoCredits": "NCT 127. SM Entertainment - Source: NME, https://www.nme.com/reviews/nct-127-sticker-review-3049921",
    "logo": "https://www.nme.com/wp-content/uploads/2021/09/nct-127-sticker-review-092021-1392x884.jpg",
    "bio": "NCT 127 is a sub-unit of the South Korean boy group NCT, formed by SM Entertainment in 2016. Comprising of members Taeyong, Taeil, Johnny, Yuta, Doyoung, Jaehyun, Jungwoo, Mark, Haechan, and Winwin, NCT 127 is known for their dynamic performances, genre-bending music, and energetic stage presence. With hits like Cherry Bomb and Kick It, they have garnered international recognition, solidifying their status as one of the leading acts in the global K-pop scene. NCT 127's diverse lineup and innovative concepts have earned them a dedicated fanbase known as NCTzens, further propelling their success both domestically and internationally",
    "genre": "Kpop",
    "slug": "nct-127"
  },
  {
    "name": "Nct Dream",
    "members": ["Renjun", "Haechan”, “Mark”, “Chenle”, “Jisung”, “Jaemin”, “Jeno"],
    "logoCredits": "NCT Dream. SM Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/nct-dream-interview-new-album-glitch-mode-1332855/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2022/04/nct-dream-2022-credit-sm-entertainment.jpg?w=1581&h=1054&crop=1",
    "bio": "NCT Dream is a sub-unit of the South Korean boy group NCT, formed by SM Entertainment in 2016. Comprising of members Mark, Renjun, Jeno, Haechan, Jaemin, Chenle, and Jisung, NCT Dream initially debuted as a rotational unit for teenage members but later transitioned into a fixed unit. Known for their youthful energy, catchy music, and synchronized choreography, NCT Dream has captivated audiences with hits like Chewing Gum and We Go Up. With their dynamic performances and relatable lyrics, they have amassed a dedicated fanbase known as NCTzens, solidifying their position as one of the prominent acts in the K-pop industry",
    "genre": "Kpop",
    "slug": "nct-dream"
  },
  {
    "name": "NewJeans",
    "members": ["Hanni", "Danielle", "Minji", "Hyein", "Haerin"],
    "logoCredits": "ADOR - Source: Grammy, https://www.grammy.com/news/newjeans-kpop-interview-ep-get-up-videos",
    "logo": "https://i8.amplience.net/i/naras/NewJeans_ADOR",
    "bio": "NewJeans is a South Korean girl group formed by ADOR. Comprising Minji, Hanni, Danielle, Haerin, and Hyein, they debuted in July 2022 with the single Attention, topping South Korea's Circle Digital Chart. Their subsequent releases, including Hype Boy and Cookie, further solidified their success. With their nostalgic sound and catchy tunes, NewJeans continues to rise as a promising presence in the K-pop scene",
    "genre": "Kpop",
    "slug": "newjeans"
  },
  {
    "name": "Nmixx",
    "members": ["Bae", "Jiwoo", "Sullyoon", "Kyujin", "Haewon", "Lily"],
    "logoCredits": "JYP Entertainment - Source: NME, https://www.nme.com/features/music-interviews/nmixx-polarising-mixx-pop-sound-fe3o4-break-dash-interview-3571458",
    "logo": "https://www.nme.com/wp-content/uploads/2024/01/nmixx-fe3o5-break-jyp-ent-image2-1392x884.jpg",
    "bio": "Nmixx is a South Korean girl group formed by SQU4D, a sub-label of JYP Entertainment. Comprising six members - Lily, Haewon, Sullyoon, Bae, Jiwoo, and Kyujin - Nmixx debuted on February 22, 2022, with the single album Ad Mare. Originally a seven-piece group, Jinni departed from the lineup on December 9, 2022, for personal reasons. The name Nmixx signifies a blend of now, new, next, and the unknown n, along with mix, symbolizing diversity and combination, representing the group's aim to be the best combination for a new era",
    "genre": "Kpop",
    "slug": "nmixx"
  },
  {
    "name": "Oneus",
    "members": ["Seoho", "Leedo", "Keonhee", "Hwanwoong", "Xion"],
    "logoCredits": "RBW Entertainment - Source: Teen Vogue, https://www.teenvogue.com/story/oneus-reach-for-us-tour-interview",
    "logo": "https://assets.teenvogue.com/photos/63d929447e922ab0f3b6d095/1:1/w_960,c_limit/%5BONEUS%5D%20단체1.jpg",
    "bio": "Oneus is a South Korean boy group formed by RBW Entertainment. Comprising of members Ravn, Seoho, Leedo, Keonhee, Hwanwoong, and Xion, Oneus debuted in 2019 with their single album Light Us. Known for their powerful performances, intricate choreography, and diverse music style blending elements of pop, rock, and hip-hop, Oneus has quickly gained recognition in the K-pop industry. With hits like Valkyrie and Lit, they have established themselves as rising stars, captivating audiences with their charisma and talent. As versatile performers and musicians, Oneus continues to evolve and leave a lasting impact on the global music scene",
    "genre": "Kpop",
    "slug": "oneus"
  },
  {
    "name": "Red velvet",
    "members": ["Joy", "Yeri", "Irene", "Seulgi", "Wendy"],
    "logoCredits": "Red Velvet. SM Entertainment - Source: NME, https://www.nme.com/news/music/red-velvet-comeback-full-group-august-confirmed-2964342",
    "logo": "https://www.nme.com/wp-content/uploads/2021/06/redvelvet-psycho-2019-1392x884.jpg",
    "bio": "Red Velvet is a South Korean girl group formed by SM Entertainment. Comprising of members Irene, Seulgi, Wendy, Joy, and Yeri, Red Velvet debuted in 2014 with the digital single Happiness. Known for their versatile music style, which encompasses genres like pop, R&B, and electronic, Red Velvet has become one of the leading acts in the K-pop industry. With iconic hits such as Red Flavor and Psycho, they have garnered widespread acclaim and a dedicated fanbase known as ReVeluvs. Renowned for their captivating performances and unique concepts, Red Velvet continues to set trends and inspire fans worldwide.",
    "genre": "Kpop",
    "slug": "red-velvet"
  },
  {
    "name": "STAYC",
    "members": ["Seeun", "J", "Sieun", "Sumin", "Yoon", "Isa"],
    "logoCredits": "High Up Entertainment - Source: NME, https://www.nme.com/news/music/stayc-comeback-teenfresh-3472355",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/stayc-high-up-entertainment-160823-1392x884.jpg",
    "bio": "Stayc is a South Korean girl group formed by High Up Entertainment. Comprising of members Sumin, Sieun, Isa, Seeun, Yoon, and J, Stayc debuted in 2020 with their single album Star To A Young Culture. Known for their powerful vocals, captivating performances, and fresh concept, Stayc has quickly gained attention in the K-pop industry. With hits like So Bad and ASAP, they have showcased their talent and charisma, earning recognition from fans and critics alike. Stayc continues to impress with their dynamic music and vibrant energy, establishing themselves as a promising presence in the global music scene",
    "genre": "Kpop",
    "slug": "stayc"
  },
  {
    "name": "Seventeen",
    "members": ["Woozi", "Seungkwan", "Mingyu", "Jeonghan", "Vernon", "Hoshi", "The8", "Dino", "Joshua", "DK", "Jun", "Wonwoo", "S.Coups"],
    "logoCredits": "Pledis Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/seventeen-follow-again-tour-maestro-video-1235009208/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2024/04/seventeen-lead.jpg?w=1581&h=1054&crop=1",
    "bio": "Seventeen is a South Korean boy group formed by Pledis Entertainment. Consisting of thirteen members - S.Coups, Jeonghan, Joshua, Jun, Hoshi, Wonwoo, Woozi, DK, Mingyu, The8, Seungkwan, Vernon, and Dino - Seventeen debuted in 2015 with their first extended play 17 Carat. Known for their self-producing abilities, intricate choreography, and diverse music style spanning genres like pop, hip-hop, and R&B, Seventeen has gained recognition as one of the most talented and innovative groups in the K-pop industry. With chart-topping hits such as Clap and Left & Right, they have established a strong fanbase known as Carats. As versatile performers and prolific songwriters, Seventeen continues to captivate audiences worldwide with their dynamic performances and heartfelt music",
    "genre": "Kpop",
    "slug": "seventeen"
  },
  {
    "name": "Shinee",
    "members": ["Key", "Onew", "Minho", "Taemin"],
    "logoCredits": "SHINee. SM Entertainment - Source: NME, https://www.nme.com/reviews/album/shinee-hard-review-3464947",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/shinee-hard-review-696x442.jpg",
    "bio": "SHINee is a South Korean boy group formed by SM Entertainment. Consisting of members Onew, Key, Minho, and Taemin, SHINee debuted in 2008 with their single album Replay. Renowned for their unique sound, intricate choreography, and experimental music style that blends pop, R&B, and electronic elements, SHINee quickly rose to fame and became known as the Princes of K-pop. With iconic hits such as Ring Ding Dong and Lucifer, they have established themselves as one of the most influential and acclaimed groups in the industry. Known for their versatility and artistic depth, SHINee continues to push boundaries and inspire fans worldwide with their music and performances",
    "genre": "Kpop",
    "slug": "shinee"
  },
  {
    "name": "Stray kids",
    "members": ["Felix", "Changbin", "Lee Know", "Han", "Seungmin", "I.N", "Bang Chan", "Hyunjin"],
    "logoCredits": "Universal Music Group - Source: The New York Times, https://www.nytimes.com/2022/03/29/arts/music/stray-kids-k-pop-billboard-chart.html",
    "logo": "https://static01.nyt.com/images/2022/03/30/arts/28billboard-item/28billboard-item-superJumbo.jpg?quality=75&auto=webp",
    "bio": "Stray Kids is a South Korean boy group formed by JYP Entertainment through the reality show Stray Kids. Comprising of members Bang Chan, Lee Know, Changbin, Hyunjin, Han, Felix, Seungmin, and I.N, Stray Kids debuted in 2018 with their extended play I Am NOT. Known for their powerful performances, introspective lyrics, and unique blend of hip-hop, EDM, and rock, Stray Kids has quickly risen to prominence in the K-pop industry. With hits like God's Menu and Back Door, they have garnered a dedicated fanbase known as Stay. Renowned for their self-produced music and dynamic stage presence, Stray Kids continues to push boundaries and make their mark as one of the most innovative groups in K-pop",
    "genre": "Kpop",
    "slug": "stray-kids"
  },
  {
    "name": "Super junior",
    "members": ["Leeteuk", "Heechul", "Yesung", "Shindong", "Sungmin", "Eunhyuk", "Siwon", "Donghae", "Ryeowook", "Kyuhyun"],
    "logoCredits": "SM Entertainment - Source: Rolling Stone, https://www.rollingstone.com/music/music-features/k-pop-super-junior-new-album-1156702/",
    "logo": "https://www.rollingstone.com/wp-content/uploads/2021/04/super-junior.jpg?w=1581&h=1054&crop=1",
    "bio": "Super Junior is a South Korean boy group formed by SM Entertainment. Initially debuting as a twelve-member group in 2005, Super Junior has become one of the most iconic and influential groups in the K-pop industry. Comprising of members Leeteuk, Heechul, Yesung, Shindong, Eunhyuk, Siwon, Donghae, Ryeowook, and Kyuhyun, Super Junior is known for their diverse music style, captivating performances, and strong vocal and dance abilities. With hits like Sorry, Sorry and Mr. Simple, they have achieved immense success both domestically and internationally, earning numerous awards and accolades. Despite lineup changes and military enlistments, Super Junior remains a powerhouse in the industry, continuing to delight fans with their music, variety show appearances, and global tours",
    "genre": "Kpop",
    "slug": "super-junior"
  },
  {
    "name": "Treasure",
    "members": ["Park Jeong-woo", "Haruto", "Jihoon", "Yoshi", "So Jung-hwan", "Junkyu", "Doyoung", "Yoon Jae-hyuk", "Choi Hyun-suk", "Asahi"],
    "logoCredits": "TREASURE. YG Entertainment - Source: NME, https://www.nme.com/features/music-interviews/a-year-in-review-treasure-look-back-on-2023-3566037",
    "logo": "https://www.nme.com/wp-content/uploads/2024/01/treasure-eoy-interview-image2-1392x885.jpg",
    "bio": "TREASURE is a South Korean boy group formed by YG Entertainment through the reality survival program YG Treasure Box. Comprising of members Hyunsuk, Jihoon, Yoshi, Junkyu, Mashiho, Jaehyuk, Asahi, Yedam, Doyoung, Haruto, Jeongwoo, and Junghwan, TREASURE debuted in 2020 with their single album The First Step: Chapter One. Known for their energetic performances, catchy music, and diverse talents, TREASURE has quickly gained popularity in the K-pop industry. With hits like Boy and My Treasure, they have captured the hearts of fans worldwide.",
    "genre": "Kpop",
    "slug": "treasure"
  },
  {
    "name": "Twice",
    "members": ["Tzuyu", "Nayeon", "Jihyo", "Dahyun", "Momo", "Sana", "Jeongyeon", "Mina", "Chaeyoung"],
    "logoCredits": "Twice. JYP Entertainment - Source: Billboard, https://www.billboard.com/music/pop/twices-talk-prioritizing-mental-health-stadiums-touring-1235613483/",
    "logo": "https://www.billboard.com/wp-content/uploads/2024/02/TWICE-2024-press-01-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Twice is a South Korean girl group formed by JYP Entertainment through the reality show Sixteen. Comprising of members Nayeon, Jeongyeon, Momo, Sana, Jihyo, Mina, Dahyun, Chaeyoung, and Tzuyu, Twice debuted in 2015 with their mini-album The Story Begins. Known for their catchy melodies, vibrant performances, and charming personalities, Twice has become one of the most popular and influential girl groups in the K-pop industry. With chart-topping hits like Cheer Up and TT, they have achieved immense success both in South Korea and internationally, earning numerous awards and accolades",
    "genre": "Kpop",
    "slug": "twice"
  },
  {
    "name": "Tomorrow X Together",
    "members": ["Soobin", "HueningKai", "Beomgyu", "Yeonjun", "Taehyun"],
    "logoCredits": "Tomorrow X Together. HYBE Entertainment - Source: Billboard, https://www.billboard.com/music/music-news/tomorrow-x-together-playlist-takeover-tuesday-8544184/",
    "logo": "https://www.billboard.com/wp-content/uploads/media/06-TOMORROW-X-TOGETHER-press-2019-cr-Big-Hit-Entertainment-billboard-1548.jpg?w=942&h=623&crop=1",
    "bio": "Tomorrow X Together, also known as TXT, is a South Korean boy band formed by HYBE Corporation. Comprised of members Soobin, Yeonjun, Beomgyu, Taehyun, and Huening Kai, TXT debuted in 2019 with their EP The Dream Chapter: Star. Known for their youthful energy, vibrant music, and intricate choreography, TXT quickly gained popularity in the K-pop scene. With hits like Crown and Run Away, they have established themselves as one of the leading fourth-generation K-pop groups. TXT continues to evolve their sound and style, captivating audiences worldwide with their talent and creativity",
    "genre": "Kpop",
    "slug": "tomorrow-x-together"
  },
  {
    "name": "Kiss of life",
    "members": ["Belle", "Natty", "Julie", "Haneul"],
    "logoCredits": "KISS OF LIFE. S2 Entertainment - Source: NME, https://www.nme.com/news/music/kiss-of-life-debut-ep-shhh-music-video-release-3465470",
    "logo": "https://www.nme.com/wp-content/uploads/2023/07/kiss-of-life-s2-entertainment-060723-1392x884.jpg",
    "bio": "Kiss of Life is a South Korean girl group formed by S2 Entertainment in 2023. Comprising of members Julie, Natty, Belle, and Haneul, they debuted on July 5, 2023, with their EP Kiss of Life. With their vibrant energy and captivating performances, Kiss of Life aims to leave a lasting impression in the K-pop industry",
    "genre": "Kpop",
    "slug": "kiss-of-life"
  },
  {
    "name": "Illit",
    "members": ["Minju", "Iroha", "Wonhee", "Moka", "Yunah"],
    "logoCredits": "ILLIT. BELIFT LAB - Source: Forbes, https://www.forbes.com/sites/jeffbenjamin/2024/03/31/illit-enter-k-pop-world-with-unprecedented-magnetic-debut-single/",
    "logo": "https://imageio.forbes.com/specials-images/imageserve/660a2cdc41fe75f40b573b06/ILLIT-K-pop-girl-group-concept-photo-for--SUPER-ME---courtesy-of-BELIFT-LAB/0x0.jpg?format=jpg&crop=3000,2000,x0,y0,safe&width=960",
    "bio": "Illit is a South Korean girl group formed by Belift Lab, a sub-label of HYBE, through the JTBC 2023 survival competition show R U Next?. Comprising of members Yunah, Minju, Moka, Wonhee, and Iroha, they debuted on March 25, 2024, with their EP Super Real Me. With their diverse talents and unique charm, Illit aims to make their mark in the K-pop industry.",
    "genre": "Kpop",
    "slug": "illit"
  },
  {
    "name": "Baby “monster",
    "members": ["Asa", "Ruka", "Ahyeon", "Pharita", "Chiquita", "Rami", "Rora"],
    "logoCredits": "YG Entertainment - Source: Soompi, https://www.soompi.com/article/1647669wpp/watch-babymonster-drops-visual-film-for-7-member-comeback-with-ahyeon",
    "logo": "https://6.soompi.io/wp-content/uploads/image/20240315151537_babymonster_6ba081.jpeg?s=900x600&e=t",
    "bio": "Baby Monster is a South Korean girl group formed by YG Entertainment through Last Evaluation (2023). Comprising of seven members - Ruka, Pharita, Asa, Ahyeon, Rami, Rora, and Chiquita, the ensemble officially debuted on April 1, 2024, with their eponymous first extended play (EP) BabyMons7er. With their diverse talents and unique charm, Baby Monster aims to carve out their own space in the K-pop industry",
    "genre": "Kpop",
    "slug": "baby-monster"
  }
]
